
import 'dart:math';

import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import 'V1V2.dart';
import 'dart:math';

import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import 'Result.dart';
import 'V1V4.dart';


class V1V3 extends StatefulWidget {
  V1V3(this.Select);
  String Select;
  @override
  State<V1V3> createState() => _V1V3State();
}
class _V1V3State extends State<V1V3> {
  var password = "";
  var aka = true;
  @override
  void initState() {
    super.initState();
  }
  Widget build(BuildContext context) {
    return Scaffold(
      body: DefaultTabController(
        length: 2,
        child: Scaffold(
          appBar: AppBar(
            backgroundColor: Colors.white,
            title:Text(widget.Select,style: TextStyle(fontWeight: FontWeight.bold,color:Colors.black),),
            iconTheme: IconThemeData(color: Colors.black),
            centerTitle: true,
            //actions: [IconButton(onPressed: (){}, icon: Icon(Icons.search),)],
            bottom: const TabBar(
              tabs: [
                Tab(child: Text("市町村",style: TextStyle(fontWeight: FontWeight.bold,color: Colors.black),),),
                Tab(child: Text("路線",style: TextStyle(fontWeight: FontWeight.bold,color: Colors.black),),),
              ],
            ),),
          body: TabBarView(children: [V1V3A(widget.Select),V1V3B(widget.Select),],
          ),),),);}

}


class V1V3A extends StatefulWidget {
  V1V3A(this.Select);
  String Select;
  @override
  State<V1V3A> createState() => _V1V3AState();
}
class _V1V3AState extends State<V1V3A> {
  @override
  @override
  bool aka = true;
  var co = 0;
  var colorbid = 0.01;
  var color = Colors.red;
  var item = [];
  var uid = "";
  void initState() {
    super.initState();
    _loadData();
  }
  Widget build(BuildContext context) {
    return new Scaffold(
        body:  Container(
            child: Column(children: <Widget>[
              Expanded(
                child: ListView.builder(
                  itemCount: item.length,
                  itemBuilder: (context, index) {
                    return GestureDetector(
                        onTap: () {   Navigator.of(context).push(MaterialPageRoute(builder: (context) => Result(item[index])));},
                        child:Card(
                          shadowColor: Colors.grey[100],
                          elevation: 3,
                          clipBehavior: Clip.antiAlias,
                          shape: RoundedRectangleBorder(
                            borderRadius: BorderRadius.circular(10),
                          ),
                          child: Container(
                            margin: EdgeInsets.all(10),
                            child:  Row(children: [ Container(margin: EdgeInsets.only(right: 10),child:Icon(Icons.airplanemode_active,color: Colors.blue,)),
                                 Container(child:Text(item[index],style: TextStyle(fontSize:20,fontWeight: FontWeight.bold,color:Colors.black))),],),),
                            ),);},),),
              Container(margin: EdgeInsets.only(top:20,bottom: 5),
                child: ElevatedButton(
                  child: const Text('検索'),
                  style: ElevatedButton.styleFrom(primary: Colors.yellow[800], onPrimary: Colors.white, shape: const StadiumBorder(),),
                  onPressed: () {},
                ),),

            ]))
    );
  }
  void _loadData()  {
    switch(widget.Select) {
      case '道央':item = ["石狩","後志","空知","胆振","日高"];break;
      case '道南':item = ["渡島","檜山"];break;
      case '道北':item = ["上川","留萌","宗谷"];break;
      case 'オホーツク':item = ["斜網","北見","遠軽","西紋"];break;
      case '十勝':item = ["北部","中部","南部"];break;
      case '釧路・根室':item = ["釧路","根室"];break;
      case '青森県':item = ["青森市","鰺ヶ沢町（西津軽郡）","板柳町（北津軽郡）","田舎館村（南津軽郡）","今別町（東津軽郡）","おいらせ町（上北郡）","大間町（下北郡）","大鰐町（南津軽郡）","風間浦村（下北郡）","黒石市","五所川原市","五戸町（三戸郡）","佐井村（下北郡）","三戸町（三戸郡）","七戸町（上北郡）","新郷村（三戸郡）","外ヶ浜町（東津軽郡）","田子町（三戸郡）","つがる市","鶴田町（北津軽郡）","東北町（上北郡）","十和田市","中泊町（北津軽郡）","南部町（三戸郡）","西目屋村（中津軽郡）","野辺地町（上北郡）","階上町（三戸郡）","八戸市","東通村（下北郡）","平川市","平内町（東津軽郡）","弘前市","深浦町（西津軽郡）","藤崎町（南津軽郡）","三沢市","むつ市","横浜町（上北郡）","蓬田村（東津軽郡）","六ヶ所村（上北郡）","六戸町（上北郡）"];break;
      case '岩手県':item = ["一関市","一戸町（二戸郡）","岩泉町（下閉伊郡）","岩手町（岩手郡）","奥州市","大槌町（上閉伊郡）","大船渡市","金ケ崎町（胆沢郡）","釜石市","軽米町（九戸郡）","北上市","久慈市","葛巻町（岩手郡）","九戸村（九戸郡）","雫石町（岩手郡）","紫波町（紫波郡）","住田町（気仙郡）","滝沢市","田野畑村（下閉伊郡）","遠野市","西和賀町（和賀郡）","二戸市","野田村（九戸郡）","八幡平市","花巻市","平泉町（西磐井郡）","洋野町（九戸郡）","普代村（下閉伊郡）","宮古市","盛岡市","矢巾町（紫波郡）","山田町（下閉伊郡）","陸前高田市"];break;
      case '秋田県':item = ["秋田市","井川町（南秋田郡）","羽後町（雄勝郡）","大潟村（南秋田郡）","大館市","男鹿市","潟上市","鹿角市","上小阿仁村（北秋田郡）","北秋田市","小坂町（鹿角郡）","五城目町（南秋田郡）","仙北市","大仙市","にかほ市","能代市","八峰町（山本郡）","八郎潟町（南秋田郡）","東成瀬村（雄勝郡）","藤里町（山本郡）","美郷町（仙北郡）","三種町（山本郡）","湯沢市","由利本荘市","横手市"];break;
      case '宮城県':item = ["石巻市","岩沼市","大河原町（柴田郡）","大崎市","大郷町（黒川郡）","大衡村（黒川郡）","女川町（牡鹿郡）","角田市","加美町（加美郡）","川崎町（柴田郡）","栗原市","気仙沼市","蔵王町（刈田郡）","塩竈市","色麻町（加美郡）","七ヶ宿町（刈田郡）","七ヶ浜町（宮城郡）","柴田町（柴田郡）","白石市","仙台市","仙台市青葉区","仙台市泉区","仙台市太白区","仙台市宮城野区","仙台市若林区","大和町（黒川郡）","多賀城市","富谷市","登米市","名取市","東松島市","松島町（宮城郡）","丸森町（伊具郡）","美里町（遠田郡）","南三陸町（本吉郡）","村田町（柴田郡）","山元町（亘理郡）","利府町（宮城郡）","涌谷町（遠田郡）","亘理町（亘理郡）",];break;
      case '山形県':item = ["朝日町（西村山郡）","飯豊町（西置賜郡）","大石田町（北村山郡）","大江町（西村山郡）","大蔵村（最上郡）","小国町（西置賜郡）","尾花沢市","金山町（最上郡）","河北町（西村山郡）","上山市","川西町（東置賜郡）","酒田市","寒河江市","鮭川村（最上郡）","庄内町（東田川郡）","白鷹町（西置賜郡）","新庄市","高畠町（東置賜郡）","鶴岡市","天童市","戸沢村（最上郡）","中山町（東村山郡）","長井市","南陽市","西川町（西村山郡）","東根市","舟形町（最上郡）","真室川町（最上郡）","三川町（東田川郡）","村山市","最上町（最上郡）","山形市","山辺町（東村山郡）","遊佐町（飽海郡）","米沢市"];break;
      case '福島県':item = ["会津坂下町（河沼郡）","会津美里町（大沼郡）","会津若松市","浅川町（石川郡）","飯舘村（相馬郡）","石川町（石川郡）","泉崎村（西白河郡）","猪苗代町（耶麻郡）","いわき市","大玉村（安達郡）","小野町（田村郡）","鏡石町（岩瀬郡）","葛尾村（双葉郡）","金山町（大沼郡）","川内村（双葉郡）","川俣町（伊達郡）","喜多方市","北塩原村（耶麻郡）","国見町（伊達郡）","桑折町（伊達郡）","郡山市","鮫川村（東白川郡）","昭和村（大沼郡）","下郷町（南会津郡）","白河市","新地町（相馬郡）","須賀川市","相馬市","只見町（南会津郡）","棚倉町（東白川郡）","玉川村（石川郡）","田村市","伊達市（福島県）","天栄村（岩瀬郡）","富岡町（双葉郡）","中島村（西白河郡）","浪江町（双葉郡）","楢葉町（双葉郡）","西会津町（耶麻郡）","西郷村（西白河郡）","二本松市","塙町（東白川郡）","磐梯町（耶麻郡）","檜枝岐村（南会津郡）","平田村（石川郡）","広野町（双葉郡）","福島市","双葉町（双葉郡）","古殿町（石川郡）","三島町（大沼郡）","南会津町（南会津郡）","南相馬市","三春町（田村郡）","本宮市","柳津町（河沼郡）","矢吹町（西白河郡）","矢祭町（東白川郡）","湯川村（河沼郡）"];break;
      case '新潟県':item = ["阿賀野市","阿賀町（東蒲原郡）","粟島浦村（岩船郡）","出雲崎町（三島郡）","糸魚川市","魚沼市","小千谷市","柏崎市","加茂市","刈羽村（刈羽郡）","五泉市","佐渡市","三条市","新発田市","上越市","聖籠町（北蒲原郡）","関川村（岩船郡）","胎内市","田上町（南蒲原郡）","津南町（中魚沼郡）","燕市","十日町市","長岡市","新潟市","新潟市秋葉区","新潟市北区","新潟市江南区","新潟市中央区","新潟市西蒲区","新潟市西区","新潟市東区","新潟市南区","妙高市","見附市","南魚沼市","村上市","弥彦村（西蒲原郡）","湯沢町（南魚沼郡）"];break;
      case '富山県':item = ["朝日町（下新川郡）","射水市","魚津市","小矢部市","上市町（中新川郡）","黒部市","高岡市","立山町（中新川郡）","砺波市","富山市","滑川市","南砺市","入善町（下新川郡）","氷見市","舟橋村（中新川郡）"];break;
      case '石川県':item = ["穴水町（鳳珠郡）","内灘町（河北郡）","加賀市","金沢市","かほく市","川北町（能美郡）","小松市","志賀町（羽咋郡）","珠洲市","津幡町（河北郡）","中能登町（鹿島郡）","七尾市","能登町（鳳珠郡）","野々市市","能美市","羽咋市","白山市","宝達志水町（羽咋郡）","輪島市"];break;
      case '福井県':item = ["あわら市","池田町（今立郡）","永平寺町（吉田郡）","越前市","越前町（丹生郡）","おおい町（大飯郡）","大野市","小浜市","勝山市","坂井市","鯖江市","高浜町（大飯郡）","敦賀市","福井市","南越前町（南条郡）","美浜町（三方郡）","若狭町（三方上中郡）"];break;
      case '山梨県':item = ["市川三郷町（西八代郡）","上野原市","大月市","忍野村（南都留郡）","甲斐市","甲州市","甲府市","小菅村（北都留郡）","昭和町（中巨摩郡）","丹波山村（北都留郡）","中央市","都留市","道志村（南都留郡）","鳴沢村（南都留郡）","南部町（南巨摩郡）","西桂町（南都留郡）","韮崎市","早川町（南巨摩郡）","笛吹市","富士河口湖町（南都留郡）","富士川町（南巨摩郡）","富士吉田市","北杜市","南アルプス市","身延町（南巨摩郡）","山中湖村（南都留郡）","山梨市"];break;
      case '長野県':item = ["青木村（小県郡）","上松町（木曽郡）","朝日村（東筑摩郡）","阿智村（下伊那郡）","安曇野市","阿南町（下伊那郡）","飯島町（上伊那郡）","飯田市","飯綱町（上水内郡）","飯山市","生坂村（東筑摩郡）","池田町（北安曇郡）","伊那市","上田市","売木村（下伊那郡）","王滝村（木曽郡）","大桑村（木曽郡）","大鹿村（下伊那郡）","大町市","岡谷市","小川村（上水内郡）","小谷村（北安曇郡）","小布施町（上高井郡）","麻績村（東筑摩郡）","軽井沢町（北佐久郡）","川上村（南佐久郡）","木島平村（下高井郡）","木曽町（木曽郡）","木祖村（木曽郡）","北相木村（南佐久郡）","小海町（南佐久郡）","駒ヶ根市","小諸市","栄村（下水内郡）","坂城町（埴科郡）","佐久市","佐久穂町（南佐久郡）","塩尻市","静岡市","信濃町（上水内郡）","下條村（下伊那郡）","下諏訪町（諏訪郡）","須坂市","諏訪市","喬木村（下伊那郡）","高森町（下伊那郡）","高山村（上高井郡）","辰野町（上伊那郡）","立科町（北佐久郡）","筑北村（東筑摩郡）","千曲市","茅野市","天龍村（下伊那郡）","東御市","豊丘村（下伊那郡）","中川村（上伊那郡）","中野市","長野市","長和町（小県郡）","南木曽町（木曽郡）","根羽村（下伊那郡）","野沢温泉村（下高井郡）","白馬村（北安曇郡）","原村（諏訪郡）","平谷村（下伊那郡）","富士見町（諏訪郡）","松川町（下伊那郡）","松川村（北安曇郡）","松本市","南相木村（南佐久郡）","南牧村（南佐久郡）","南箕輪村（上伊那郡）","箕輪町（上伊那郡）","宮田村（上伊那郡）","御代田町（北佐久郡）","泰阜村（下伊那郡）","山形村（東筑摩郡）","山ノ内町（下高井郡）"];break;
      case '栃木県':item = ["足利市","市貝町（芳賀郡）","宇都宮市","大田原市","小山市","鹿沼市","上三川町（河内郡）","さくら市","佐野市","塩谷町（塩谷郡）","下野市","高根沢町（塩谷郡）","栃木市","那珂川町（那須郡）","那須烏山市","那須塩原市","那須町（那須郡）","日光市","野木町（下都賀郡）","芳賀町（芳賀郡）","益子町（芳賀郡）","壬生町（下都賀郡）","真岡市","茂木町（芳賀郡）","矢板市"];break;
      case '群馬県':item = ["安中市","伊勢崎市","板倉町（邑楽郡）","上野村（多野郡）","邑楽町（邑楽郡）","大泉町（邑楽郡）","太田市","片品村（利根郡）","川場村（利根郡）","神流町（多野郡）","甘楽町（甘楽郡）","桐生市","草津町（吾妻郡）","昭和村（利根郡）","渋川市","下仁田町（甘楽郡）","榛東村（北群馬郡）","高崎市","高山村（吾妻郡）","館林市","玉村町（佐波郡）","千代田町（邑楽郡）","嬬恋村（吾妻郡）","富岡市","中之条町（吾妻郡）","長野原町（吾妻郡）","南牧村（甘楽郡）","沼田市","東吾妻町（吾妻郡）","藤岡市","前橋市","みどり市","みなかみ町（利根郡）","明和町（邑楽郡）","吉岡町（北群馬郡）"];break;
      case '茨城県':item = ["阿見町（稲敷郡）","石岡市","潮来市","稲敷市","茨城町（東茨城郡）","牛久市","大洗町（東茨城郡）","小美玉市","笠間市","鹿嶋市","かすみがうら市","神栖市","河内町（稲敷郡）","北茨城市","古河市","五霞町（猿島郡）","境町（猿島郡）","桜川市","下妻市","城里町（東茨城郡）","常総市","高萩市","大子町（久慈郡）","筑西市","つくば市","つくばみらい市","土浦市","東海村（那珂郡）","利根町（北相馬郡）","取手市","那珂市","行方市","坂東市","常陸太田市","常陸大宮市","日立市","ひたちなか市","鉾田市","水戸市","美浦村（稲敷郡）","守谷市","八千代町（結城郡）","結城市","龍ケ崎市"];break;
      case '埼玉県':item = ["上尾市","朝霞市","伊奈町（北足立郡）","入間市","小鹿野町（秩父郡）","小川町（比企郡）","桶川市","越生町（入間郡）","春日部市","加須市","神川町（児玉郡）","上里町（児玉郡）","川口市","川越市","川島町（比企郡）","北本市","行田市","久喜市","熊谷市","久喜市","熊谷市","鴻巣市","越谷市","幸手市","さいたま市","さいたま市岩槻区","さいたま市浦和区","さいたま市大宮区","さいたま市北区","さいたま市桜区","さいたま市中央区","さいたま市西区","さいたま市緑区","さいたま市南区","さいたま市見沼区","坂戸市","狭山市","志木市","白岡市","杉戸町（北葛飾郡）","草加市","秩父市","鶴ヶ島市","ときがわ町（比企郡）","所沢市","戸田市","長瀞町（秩父郡）","滑川町（比企郡）","新座市","蓮田市","鳩山町（比企郡）","羽生市","飯能市","東秩父村（秩父郡）","東松山市","日高市","深谷市","富士見市","ふじみ野市","本庄市","松伏町（北葛飾郡）","三郷市","美里町（児玉郡）","皆野町（秩父郡）","宮代町（南埼玉郡）","三芳町（入間郡）","毛呂山町（入間郡）","八潮市","横瀬町（秩父郡）","吉川市","吉見町（比企郡）","寄居町（大里郡）","嵐山町（比企郡）","和光市","蕨市"];break;
      case '東京都':item = ["青ヶ島村","昭島市","あきる野市","足立区","荒川区","板橋区","稲城市","江戸川区","青梅市","大島町","大田区","小笠原村","奥多摩町（西多摩郡）","葛飾区","北区","清瀬市","国立市","神津島村","江東区","小金井市","国分寺市","小平市","狛江市","品川区","渋谷区","新宿区","杉並区","墨田区","世田谷区","台東区","立川市","多摩市","中央区","調布市","千代田区","豊島区","利島村","中野区","新島村","西東京市","練馬区","八王子市","八丈町","羽村市","東久留米市","東村山市","東大和市","日野市","日の出町（西多摩郡）","檜原村（西多摩郡）","福生市","府中市（東京都）","文京区","町田市","御蔵島村","瑞穂町（西多摩郡）","三鷹市","港区","三宅村","武蔵野市","武蔵村山市","目黒区"];break;
      case '千葉県':item = ["旭市","我孫子市","いすみ市","市川市","一宮町（長生郡）","市原市","印西市","浦安市","大網白里市","大多喜町（夷隅郡）","御宿町（夷隅郡）","柏市","勝浦市","香取市","鎌ケ谷市","鴨川市","鋸南町（安房郡）","木更津市","君津市","九十九里町（山武郡）","神崎町（香取郡）","栄町（印旛郡）","佐倉市","山武市","酒々井町（印旛郡）","芝山町（山武郡）","白子町（長生郡）","白井市","匝瑳市","袖ケ浦市","多古町（香取郡）","館山市","銚子市","長生村（長生郡）","長南町（長生郡）","千葉市","千葉市稲毛区","千葉市中央区","千葉市花見川区","千葉市緑区","千葉市美浜区","千葉市若葉区","東金市","東庄町（香取郡）","富里市","長柄町（長生郡）","流山市","習志野市","成田市","野田市","富津市","船橋市","松戸市","南房総市","睦沢町（長生郡）","茂原市","八街市","八千代市","横芝光町（山武郡）","四街道市"];break;
      case '神奈川県':item = ["愛川町（愛甲郡）","厚木市","綾瀬市","伊勢原市","海老名市","大磯町（中郡）","大井町（足柄上郡）","小田原市","開成町（足柄上郡）","鎌倉市","川崎市","川崎市麻生区","川崎市川崎区","川崎市幸区","川崎市高津区","川崎市多摩区","川崎市中原区","川崎市宮前区","清川村（愛甲郡）","相模原市","相模原市中央区","相模原市緑区","相模原市南区","寒川町（高座郡）","座間市","逗子市","茅ヶ崎市","中井町（足柄上郡）","二宮町（中郡）","箱根町（足柄下郡）","秦野市","葉山町（三浦郡）","平塚市","藤沢市","松田町（足柄上郡）","真鶴町（足柄下郡）","三浦市","南足柄市","山北町（足柄上郡）","大和市","湯河原町（足柄下郡）","横須賀市","横浜市","横浜市青葉区","横浜市旭区","横浜市泉区","横浜市磯子区","横浜市神奈川区","横浜市金沢区","横浜市港南区","横浜市港北区","横浜市栄区","横浜市瀬谷区","横浜市都筑区","横浜市鶴見区","横浜市戸塚区","横浜市中区","横浜市西区","横浜市保土ケ谷区","横浜市緑区","横浜市南区"];break;
      case '岐阜県':item = ["安八町（安八郡）","池田町（揖斐郡）","揖斐川町（揖斐郡）","恵那市","大垣市","大野町（揖斐郡）","海津市","各務原市","笠松町（羽島郡）","可児市","川辺町（加茂郡）","北方町（本巣郡）","岐南町（羽島郡）","岐阜市","郡上市","下呂市","神戸町（安八郡）","坂祝町（加茂郡）","白川町（加茂郡）","白川村（大野郡）","関ケ原町（不破郡）","関市","高山市","多治見市","垂井町（不破郡）","土岐市","富加町（加茂郡）","中津川市","羽島市","東白川村（加茂郡）","飛騨市","七宗町（加茂郡）","瑞浪市","瑞穂市","御嵩町（可児郡）","美濃加茂市","美濃市","本巣市","八百津町（加茂郡）","山県市","養老町（養老郡）","輪之内町（安八郡）"];break;
      case '静岡県':item = ["熱海市","伊豆市","伊豆の国市","伊東市","磐田市","御前崎市","小山町（駿東郡）","掛川市","河津町（賀茂郡）","川根本町（榛原郡）","函南町（田方郡）","菊川市","湖西市","御殿場市","静岡市","静岡市葵区","静岡市清水区","静岡市駿河区","島田市","清水町（駿東郡）","下田市","裾野市","長泉町（駿東郡）","西伊豆町（賀茂郡）","沼津市","浜松市","浜松市北区","浜松市天竜区","浜松市中区","浜松市西区","浜松市浜北区","浜松市東区","浜松市南区","東伊豆町（賀茂郡）","袋井市","藤枝市","富士市","富士宮市","牧之原市","松崎町（賀茂郡）","三島市","南伊豆町（賀茂郡）","森町（周智郡）","焼津市","吉田町（榛原郡）"];break;
      case '愛知県':item = ["愛西市","阿久比町（知多郡）","あま市","安城市","一宮市","稲沢市","犬山市","岩倉市","大口町（丹羽郡）","大治町（海部郡）","大府市","岡崎市","尾張旭市","春日井市","蟹江町（海部郡）","刈谷市","蒲郡市","北名古屋市","清須市","幸田町（額田郡）","江南市","小牧市","設楽町（北設楽郡）","新城市","瀬戸市","高浜市","武豊町（知多郡）","田原市","知多市","知立市","津島市","東栄町（北設楽郡）","東海市","東郷町（愛知郡）","常滑市","飛島村（海部郡）","豊明市","豊川市","豊田市","豊根村（北設楽郡）","豊橋市","豊山町（西春日井郡）","長久手市","名古屋市","名古屋市熱田区","名古屋市北区","名古屋市昭和区","名古屋市千種区","名古屋市天白区","名古屋市中川区","名古屋市中区","名古屋市中村区","名古屋市西区","名古屋市東区","名古屋市瑞穂区","名古屋市緑区","名古屋市港区","名古屋市南区","名古屋市名東区","名古屋市守山区","日進市","西尾市","半田市","東浦町（知多郡）","扶桑町（丹羽郡）","碧南市","南知多町（知多郡）","美浜町（知多郡）","みよし市","弥富市"];break;
      case '三重県':item = ["朝日町（三重郡）","伊賀市","伊勢市","いなべ市","大台町（多気郡）","尾鷲市","亀山市","川越町（三重郡）","木曽岬町（桑名郡）","紀宝町（南牟婁郡）","紀北町（北牟婁郡）","熊野市","桑名市","菰野町（三重郡）","志摩市","鈴鹿市","大紀町（度会郡）","多気町（多気郡）","玉城町（度会郡）","津市","東員町（員弁郡）","鳥羽市","名張市","松阪市","南伊勢町（度会郡）","御浜町（南牟婁郡）","明和町（多気郡）","四日市市","度会町（度会郡）"];break;
      case '滋賀県':item =["愛荘町（愛知郡）","近江八幡市","大津市","草津市","甲賀市","甲良町（犬上郡）","湖南市","高島市","多賀町（犬上郡）","豊郷町（犬上郡）","長浜市","東近江市","彦根市","日野町（蒲生郡）","米原市","守山市","野洲市","竜王町（蒲生郡）","栗東市"];break;
      case '京都府':item = ["綾部市","井手町（綴喜郡）","伊根町（与謝郡）","宇治市","宇治田原町（綴喜郡）","大山崎町（乙訓郡）","笠置町（相楽郡）","亀岡市","京田辺市","京丹後市","京丹波町（船井郡）","京都市","京都市右京区","京都市上京区","京都市北区","京都市左京区","京都市下京区","京都市中京区","京都市西京区","京都市東山区","京都市伏見区","京都市南区","京都市山科区","木津川市","久御山町（久世郡）","城陽市","精華町（相楽郡）","長岡京市","南丹市","福知山市","舞鶴市","南山城村（相楽郡）","宮津市","向日市","八幡市","与謝野町（与謝郡）","和束町（相楽郡）"];break;
      case '大阪府':item = ["池田市","泉大津市","泉佐野市","和泉市","茨木市","大阪狭山市","大阪市","大阪市旭区","大阪市阿倍野区","大阪市生野区","大阪市北区","大阪市此花区","大阪市城東区","大阪市住之江区","大阪市住吉区","大阪市大正区","大阪市中央区","大阪市鶴見区","大阪市天王寺区","大阪市浪速区","大阪市西区","大阪市西成区","大阪市西淀川区","大阪市東住吉区","大阪市東成区","大阪市東淀川区","大阪市平野区","大阪市福島区","大阪市港区","大阪市都島区","大阪市淀川区","貝塚市","柏原市","交野市","門真市","河南町（南河内郡）","河内長野市","岸和田市","熊取町（泉南郡）","堺市","堺市北区","堺市堺区","堺市中区","堺市西区","堺市東区","堺市南区","堺市美原区","四條畷市","島本町（三島郡）","吹田市","摂津市","泉南市","太子町（南河内郡）","高石市","高槻市","田尻町（泉南郡）","忠岡町（泉北郡）","大東市","千早赤阪村（南河内郡）","豊中市","豊能町（豊能郡）","富田林市","寝屋川市","能勢町（豊能郡）","羽曳野市","阪南市","東大阪市","枚方市","藤井寺市","松原市","岬町（泉南郡）","箕面市","守口市","八尾市"];break;
      case '兵庫県':item = ["相生市","明石市","赤穂市","朝来市","芦屋市","尼崎市","淡路市","伊丹市","市川町（神崎郡）","猪名川町（川辺郡）","稲美町（加古郡）","小野市","加古川市","加西市","加東市","神河町（神崎郡）","上郡町（赤穂郡）","香美町（美方郡）","川西市","神戸市","神戸市北区","神戸市須磨区","神戸市垂水区","神戸市中央区","神戸市長田区","神戸市灘区","神戸市西区","神戸市兵庫区","神戸市東灘区","佐用町（佐用郡）","三田市","宍粟市","新温泉町（美方郡）","洲本市","太子町（揖保郡）","高砂市","多可町（多可郡）","宝塚市","たつの市","丹波篠山市","丹波市","豊岡市","西宮市","西脇市","播磨町（加古郡）","姫路市","福崎町（神崎郡）","三木市","南あわじ市","養父市"];break;
      case '奈良県':item = ["明日香村（高市郡）","安堵町（生駒郡）","斑鳩町（生駒郡）","生駒市","宇陀市","王寺町（北葛城郡）","大淀町（吉野郡）","橿原市","香芝市","葛城市","上北山村（吉野郡）","河合町（北葛城郡）","川上村（吉野郡）","川西町（磯城郡）","上牧町（北葛城郡）","黒滝村（吉野郡）","広陵町（北葛城郡）","五條市","御所市","桜井市","三郷町（生駒郡）","下市町（吉野郡）","下北山村（吉野郡）","曽爾村（宇陀郡）","高取町（高市郡）","田原本町（磯城郡）","天川村（吉野郡）","天理市","十津川村（吉野郡）","奈良市","野迫川村（吉野郡）","東吉野村（吉野郡）","平群町（生駒郡）","御杖村（宇陀郡）","三宅町（磯城郡）","山添村（山辺郡）","大和郡山市","大和高田市","吉野町（吉野郡）"];break;
      case '和歌山県':item =["有田川町（有田郡）","有田市","印南町（日高郡）","岩出市","海南市","かつらぎ町（伊都郡）","上富田町（西牟婁郡）","北山村（東牟婁郡）","紀の川市","紀美野町（海草郡）","串本町（東牟婁郡）","九度山町（伊都郡）","高野町（伊都郡）","古座川町（東牟婁郡）","御坊市","白浜町（西牟婁郡）","新宮市","すさみ町（西牟婁郡）","太地町（東牟婁郡）","田辺市","那智勝浦町（東牟婁郡）","橋本市","日高川町（日高郡）","日高町（日高郡）","広川町（有田郡）","みなべ町（日高郡）","美浜町（日高郡）","湯浅町（有田郡）","由良町（日高郡）","和歌山市"];break;
      case '鳥取県':item = ["岩美町（岩美郡）","倉吉市","江府町（日野郡）","琴浦町（東伯郡）","境港市","大山町（西伯郡）","智頭町（八頭郡）","鳥取市","南部町（西伯郡）","日南町（日野郡）","日吉津村（西伯郡）","日野町（日野郡）","伯耆町（西伯郡）","北栄町（東伯郡）","三朝町（東伯郡）","八頭町（八頭郡）","湯梨浜町（東伯郡）","米子市","若桜町（八頭郡）"];break;
      case '島根県':item = ["海士町（隠岐郡）","飯南町（飯石郡）","出雲市","雲南市","大田市","邑南町（邑智郡）","隠岐の島町（隠岐郡）","奥出雲町（仁多郡）","川本町（邑智郡）","江津市","知夫村（隠岐郡）","津和野町（鹿足郡）","西ノ島町（隠岐郡）","浜田市","益田市","松江市","美郷町（邑智郡）","安来市","吉賀町（鹿足郡）"];break;
      case '岡山県':item = ["赤磐市","浅口市","井原市","岡山市","岡山市北区","岡山市中区","岡山市東区","岡山市南区","鏡野町（苫田郡）","笠岡市","吉備中央町（加賀郡）","久米南町（久米郡）","倉敷市","里庄町（浅口郡）","勝央町（勝田郡）","新庄村（真庭郡）","瀬戸内市","総社市","高梁市","玉野市","津山市","奈義町（勝田郡）","新見市","西粟倉村（英田郡）","早島町（都窪郡）","備前市","真庭市","美咲町（久米郡）","美作市","矢掛町（小田郡）","和気町（和気郡）"];break;
      case '広島県':item = ["安芸太田町（山県郡）","安芸高田市","江田島市","大崎上島町（豊田郡）","大竹市","尾道市","海田町（安芸郡）","北広島町（山県郡）","熊野町（安芸郡）","呉市","坂町（安芸郡）","庄原市","神石高原町（神石郡）","世羅町（世羅郡）","竹原市","廿日市市","東広島市","広島市","広島市安芸区","広島市安佐北区","広島市安佐南区","広島市佐伯区","広島市中区","広島市西区","広島市東区","広島市南区","福山市","府中市（広島県）","府中町（安芸郡）","三原市","三次市"];break;
      case '山口県':item = ["阿武町（阿武郡）","岩国市","宇部市","上関町（熊毛郡）","下松市","山陽小野田市","周南市","下関市","周防大島町（大島郡）","田布施町（熊毛郡）","長門市","萩市","光市","平生町（熊毛郡）","防府市","美祢市","柳井市","山口市","和木町（玖珂郡）"];break;
      case '徳島県':item = ["藍住町（板野郡）","阿南市","阿波市","石井町（名西郡）","板野町（板野郡）","海陽町（海部郡）","勝浦町（勝浦郡）","上板町（板野郡）","上勝町（勝浦郡）","神山町（名西郡）","北島町（板野郡）","小松島市","佐那河内村（名東郡）","つるぎ町（美馬郡）","徳島市","那賀町（那賀郡）","鳴門市","東みよし町（三好郡）","松茂町（板野郡）","美波町（海部郡）","美馬市","三好市","牟岐町（海部郡）","吉野川市"];break;
      case '香川県':item = ["綾川町（綾歌郡）","宇多津町（綾歌郡）","観音寺市","琴平町（仲多度郡）","坂出市","さぬき市","小豆島町（小豆郡）","善通寺市","高松市","多度津町（仲多度郡）","土庄町（小豆郡）","直島町（香川郡）","東かがわ市","丸亀市","まんのう町（仲多度郡）","三木町（木田郡）","三豊市"];break;
      case '愛媛県':item = ["愛南町（南宇和郡）","伊方町（西宇和郡）","今治市","伊予市","内子町（喜多郡）","宇和島市","大洲市","上島町（越智郡）","鬼北町（北宇和郡）","久万高原町（上浮穴郡）","西条市","四国中央市","西予市","東温市","砥部町（伊予郡）","新居浜市","松前町（伊予郡）","松野町（北宇和郡）","松山市","八幡浜市"];break;
      case '高知県':item = ["安芸市","いの町（吾川郡）","馬路村（安芸郡）","大川村（土佐郡）","大月町（幡多郡）","大豊町（長岡郡）","越知町（高岡郡）","香美市","北川村（安芸郡）","黒潮町（幡多郡）","芸西村（安芸郡）","高知市","香南市","佐川町（高岡郡）","四万十市","四万十町（高岡郡）","宿毛市","須崎市","田野町（安芸郡）","津野町（高岡郡）","東洋町（安芸郡）","土佐市","土佐清水市","土佐町（土佐郡）","中土佐町（高岡郡）","奈半利町（安芸郡）","南国市","仁淀川町（吾川郡）","日高村（高岡郡）","三原村（幡多郡）","室戸市","本山町（長岡郡）","安田町（安芸郡）","梼原町（高岡郡）",];break;
      case '福岡県':item = ["赤村（田川郡）","朝倉市","芦屋町（遠賀郡）","飯塚市","糸島市","糸田町（田川郡）","うきは市","宇美町（糟屋郡）","大川市","大木町（三潴郡）","大任町（田川郡）","大野城市","大牟田市","岡垣町（遠賀郡）","小郡市","遠賀町（遠賀郡）","春日市","粕屋町（糟屋郡）","嘉麻市","川崎町（田川郡）","香春町（田川郡）","苅田町（京都郡）","北九州市","北九州市小倉北区","北九州市小倉南区","北九州市戸畑区","北九州市門司区","北九州市八幡西区","北九州市八幡東区","北九州市若松区","鞍手町（鞍手郡）","久留米市","桂川町（嘉穂郡）","上毛町（築上郡）","古賀市","小竹町（鞍手郡）","篠栗町（糟屋郡）","志免町（糟屋郡）","新宮町（糟屋郡）","須恵町（糟屋郡）","添田町（田川郡）","田川市","大刀洗町（三井郡）","太宰府市","筑後市","筑紫野市","築上町（築上郡）","筑前町（朝倉郡）","東峰村（朝倉郡）","那珂川市","中間市","直方市","久山町（糟屋郡）","広川町（八女郡）","福岡市","福岡市早良区","福岡市城南区","福岡市中央区","福岡市西区","福岡市博多区","福岡市東区","福岡市南区","福智町（田川郡）","福津市","豊前市","水巻町（遠賀郡）","みやこ町（京都郡）","みやま市","宮若市","宗像市","柳川市","八女市","行橋市","吉富町（築上郡）"];break;
      case '佐賀県':item = ["有田町（西松浦郡）","伊万里市","嬉野市","大町町（杵島郡）","小城市","鹿島市","上峰町（三養基郡）","唐津市","神埼市","基山町（三養基郡）","玄海町（東松浦郡）","江北町（杵島郡）","佐賀市","白石町（杵島郡）","多久市","武雄市","太良町（藤津郡）","鳥栖市","みやき町（三養基郡）","吉野ヶ里町（神埼郡）"];break;
      case '長崎県':item = ["壱岐市","諫早市","雲仙市","大村市","小値賀町（北松浦郡）","川棚町（東彼杵郡）","五島市","西海市","佐々町（北松浦郡）","佐世保市","島原市","新上五島町（南松浦郡）","対馬市","時津町（西彼杵郡）","長崎市","長与町（西彼杵郡）","波佐見町（東彼杵郡）","東彼杵町（東彼杵郡）","平戸市","松浦市","南島原市"];break;
      case '熊本県':item = ["あさぎり町（球磨郡）","芦北町（葦北郡）","阿蘇市","天草市","荒尾市","五木村（球磨郡）","宇城市","宇土市","産山村（阿蘇郡）","大津町（菊池郡）","小国町（阿蘇郡）","嘉島町（上益城郡）","上天草市","菊池市","菊陽町（菊池郡）","玉東町（玉名郡）","球磨村（球磨郡）","熊本市","熊本市北区","熊本市中央区","熊本市西区","熊本市東区","熊本市南区","甲佐町（上益城郡）","合志市","相良村（球磨郡）","高森町（阿蘇郡）","玉名市","多良木町（球磨郡）","津奈木町（葦北郡）","長洲町（玉名郡）","和水町（玉名郡）","南関町（玉名郡）","錦町（球磨郡）","西原村（阿蘇郡）","氷川町（八代郡）","人吉市","益城町（上益城郡）","美里町（下益城郡）","水上村（球磨郡）","水俣市","南阿蘇村（阿蘇郡）","南小国町（阿蘇郡）","御船町（上益城郡）","八代市","山江村（球磨郡）","山鹿市","山都町（上益城郡）","湯前町（球磨郡）","苓北町（天草郡）"];break;
      case '大分県':item = ["宇佐市","臼杵市","大分市","杵築市","玖珠町（玖珠郡）","国東市","九重町（玖珠郡）","佐伯市","竹田市","津久見市","中津市","日出町（速見郡）","日田市","姫島村（東国東郡）","豊後大野市","豊後高田市","別府市","由布市"];break;
      case '宮崎県':item = ["綾町（東諸県郡）","えびの市","門川町（東臼杵郡）","川南町（児湯郡）","木城町（児湯郡）","串間市","国富町（東諸県郡）","小林市","五ヶ瀬町（西臼杵郡）","西都市","椎葉村（東臼杵郡）","新富町（児湯郡）","高千穂町（西臼杵郡）","高鍋町（児湯郡）","高原町（西諸県郡）","都農町（児湯郡）","西米良村（児湯郡）","日南市","延岡市","日向市","日之影町（西臼杵郡）","美郷町（東臼杵郡）","三股町（北諸県郡）","都城市","宮崎市","諸塚村（東臼杵郡）"];break;
      case '鹿児島県':item = ["姶良市","阿久根市","天城町（大島郡）","奄美市","伊佐市","出水市","伊仙町（大島郡）","いちき串木野市","指宿市","宇検村（大島郡）","大崎町（曽於郡）","鹿児島市","鹿屋市","喜界町（大島郡）","肝付町（肝属郡）","霧島市","錦江町（肝属郡）","薩摩川内市","さつま町（薩摩郡）","志布志市","瀬戸内町（大島郡）","曽於市","龍郷町（大島郡）","垂水市","知名町（大島郡）","徳之島町（大島郡）","十島村（鹿児島郡）","中種子町（熊毛郡）","長島町（出水郡）","西之表市","日置市","東串良町（肝属郡）","枕崎市","三島村（鹿児島郡）","南大隅町（肝属郡）","南九州市","南さつま市","南種子町（熊毛郡）","屋久島町（熊毛郡）","大和村（大島郡）","湧水町（姶良郡）","与論町（大島郡）","和泊町（大島郡）"];break;
      case '沖縄県':item =["粟国村（島尻郡）","伊江村（国頭郡）","石垣市","伊是名村（島尻郡）","糸満市","伊平屋村（島尻郡）","浦添市","うるま市","大宜味村（国頭郡）","沖縄市","恩納村（国頭郡）","嘉手納町（中頭郡）","北大東村（島尻郡）","北中城村（中頭郡）","金武町（国頭郡）","宜野座村（国頭郡）","宜野湾市","国頭村（国頭郡）","久米島町（島尻郡）","座間味村（島尻郡）","竹富町（八重山郡）","多良間村（宮古郡）","北谷町（中頭郡）","渡嘉敷村（島尻郡）","渡名喜村（島尻郡）","豊見城市","中城村（中頭郡）","今帰仁村（国頭郡）","名護市","那覇市","南城市","西原町（中頭郡）","南風原町（島尻郡）","東村（国頭郡）","南大東村（島尻郡）","宮古島市","本部町（国頭郡）","八重瀬町（島尻郡）","与那国町（八重山郡）","与那原町（島尻郡）","読谷村（中頭郡）"];break;
      default:
        break;
    } setState(() {});
  }
  void _loadData2()  {
    switch(widget.Select) {
      case "":item = [];break;
      case '北海道':item = ["","","","","",""];break;
      case "JR函館本線(函館〜長万部)":item = ["函館","五稜郭","桔梗","大中山","七飯","新函館北斗","仁山","大沼（北海道）","大沼公園","赤井川","駒ヶ岳","森（北海道）","鹿部","渡島沼尻","渡島砂原","掛澗","尾白内","東森","石倉","落部","野田生","山越","八雲","山崎（北海道）","黒岩","国縫","中ノ沢", "長万部"   ];break;
      case "JR函館本線(長万部〜小樽)":item = ["長万部","二股","黒松内","熱郛","目名","蘭越","昆布","ニセコ","比羅夫","倶知安","小沢（北海道）","銀山","然別","仁木","余市","蘭島","塩谷","小樽"];break;
      case "JR函館本線(小樽〜旭川)":item = ["小樽","南小樽","小樽築港","朝里","銭函","ほしみ","星置","稲穂","手稲","稲積公園","発寒","発寒中央","琴似（ＪＲ）","桑園","札幌","苗穂","白石（北海道・ＪＲ）","厚別","森林公園（北海道）","大麻","野幌","高砂（北海道）","江別","豊幌","幌向","上幌向","岩見沢","峰延","光珠内","美唄","茶志内","奈井江","豊沼","砂川","滝川","江部乙","妹背牛","深川","納内","近文","旭川"];break;
      case "JR室蘭本線(長万部・室蘭〜苫小牧)":item = ["長万部","静狩","小幌","礼文","大岸","豊浦","洞爺","有珠","長和","伊達紋別駅","北舟岡駅","稀府駅","黄金駅","崎守駅","本輪西駅","室蘭駅","母恋駅","御崎駅","輪西駅","東室蘭駅","鷲別駅","幌別駅","富浦駅","登別駅","虎杖浜駅","竹浦駅","北吉原駅","萩野駅","白老駅","社台駅","錦岡駅","糸井駅","青葉駅","苫小牧駅",];break;
      case "JR室蘭本線(苫小牧〜岩見沢)":item = ["苫小牧駅","沼ノ端駅","遠浅駅","早来駅","安平駅","追分駅","三川駅","古山駅","由仁駅","栗山駅","栗丘駅","栗沢駅","志文駅","岩見沢駅"];break;
      case "JR根室本線(滝川〜新得)":item = ["滝川駅","東滝川駅","赤平駅","茂尻駅","平岸駅","芦別駅","上芦別駅","野花南駅","富良野駅","布部駅","山部駅","下金山駅","金山駅","東鹿越駅","幾寅駅","落合駅","新得駅"];break;
      case "JR根室本線(新得〜釧路)":item = ["新得駅","十勝清水駅","御影駅","芽室駅","大成駅","西帯広駅","柏林台駅","帯広駅","札内駅","幕別駅","利別駅","池田駅","十弗駅","豊頃駅","新吉野駅","浦幌駅","厚内駅","音別駅","白糠駅","西庶路駅","庶路駅","大楽毛駅","新大楽毛駅","新富士駅","釧路駅"];break;
      case "JR根室本線(花咲線)":item = ["釧路駅","東釧路駅","武佐駅","別保駅","上尾幌駅","尾幌駅","門静駅","厚岸駅","糸魚沢駅","茶内駅","浜中駅","姉別駅","厚床駅","別当賀駅","落石駅","昆布盛駅","西和田駅","東根室駅","根室駅"];break;
      case "JR千歳線":item = ["苫小牧駅","沼ノ端駅","植苗駅","新千歳空港駅","南千歳駅","千歳駅","長都駅","サッポロビール庭園駅","恵庭駅","恵み野駅","島松駅","北広島駅","上野幌駅","新札幌駅","平和駅","白石駅","苗穂駅","札幌駅"];break;
      case "JR石勝線":item = ["南千歳駅","追分駅","川端駅","滝ノ上駅","新夕張駅","占冠駅","トマム駅","新得駅"];break;
      case "JR日高本線":item = ["苫小牧駅","勇払駅","浜厚真駅","浜田浦駅","鵡川駅","汐見駅","富川駅","日高門別駅","豊郷駅","清畠駅","厚賀駅","大狩部駅","節婦駅","新冠駅","静内駅","東静内駅","春立駅","日高東別駅","日高三石駅","蓬栄駅","本桐駅","荻伏駅","絵笛駅","浦河駅","東町駅","日高幌別駅","鵜苫駅","西様似駅","様似駅"];break;
      case "JR札沼線":item = ["札幌駅","桑園駅","八軒駅","新川駅","新琴似駅","太平駅","百合が原駅","篠路駅","拓北駅","あいの里教育大駅","あいの里公園駅","石狩太美駅","石狩当別駅","北海道医療大学駅"];break;
      case "JR留萌本線":item = ["深川駅","北一已駅","秩父別駅","北秩父別駅","石狩沼田駅","真布駅","恵比島駅","峠下駅","幌糠駅","藤山駅","大和田駅","留萌駅",];break;
      case "JR富良野線":item = ["旭川駅","神楽岡駅","緑が丘駅","西御料駅","西瑞穂駅","西神楽駅","西聖和駅","千代ケ岡駅","北美瑛駅","美瑛駅","美馬牛駅","上富良野駅","西中駅","ラベンダー畑駅","中富良野駅","鹿討駅","学田駅","富良野駅",];break;
      case "JR宗谷本線":item = ["旭川駅","旭川四条駅","新旭川駅","永山駅","北永山駅","比布駅","蘭留駅","塩狩駅","和寒駅","剣淵駅","士別駅","多寄駅","瑞穂駅","風連駅","東風連駅","名寄駅","日進駅","智恵文駅","智北駅","美深駅","初野駅","恩根内駅","天塩川温泉駅","咲来駅","音威子府駅","筬島駅","佐久駅","天塩中川駅","歌内駅","問寒別駅","糠南駅","雄信内駅","南幌延駅","幌延駅","下沼駅","豊富駅","兜沼駅","勇知駅","抜海駅","南稚内駅","稚内駅"];break;
      case "JR石北本線":item = ["旭川駅","旭川四条駅","新旭川駅","南永山駅","東旭川駅","桜岡駅","当麻駅","伊香牛駅","愛別駅","中愛別駅","愛山駅","安足間駅","上川駅","白滝駅","丸瀬布駅","瀬戸瀬駅","遠軽駅","安国駅","生田原駅","西留辺蘂駅","留辺蘂駅","相内駅","東相内駅","西北見駅","北見駅","柏陽駅","愛し野駅","端野駅","緋牛内駅","美幌駅","西女満別駅","女満別駅","呼人駅","網走駅",];break;
      case "JR釧網本線":item = ["網走駅","桂台駅","鱒浦駅","藻琴駅","北浜駅","原生花園駅","浜小清水駅","止別駅","知床斜里駅","中斜里駅","清里町駅","札弦駅","緑駅","川湯温泉駅","美留和駅","摩周駅","磯分内駅","標茶駅","茅沼駅","塘路駅","細岡駅","釧路湿原駅","遠矢駅","東釧路駅","釧路駅"];break;
      case "札幌市営地下鉄東西線":item = ["宮の沢駅","発寒南駅","琴似駅","二十四軒駅","西２８丁目駅","円山公園駅","西１８丁目駅","西１１丁目駅","大通駅","バスセンター前駅","菊水駅","東札幌駅","白石駅","南郷７丁目駅","南郷１３丁目駅","南郷１８丁目駅","大谷地駅","ひばりが丘駅","新さっぽろ駅"];break;
      case "札幌市営地下鉄南北線":item = ["麻生駅","北３４条駅","北２４条駅","北１８条駅","北１２条駅","さっぽろ駅","大通駅","すすきの駅","中島公園駅","幌平橋駅","中の島駅","平岸駅","南平岸駅","澄川駅","自衛隊前駅","真駒内駅"];break;
      case "札幌市営地下鉄東豊線":item = ["栄町駅","新道東駅","元町駅","環状通東駅","東区役所前駅","北１３条東駅","さっぽろ駅","大通駅","豊水すすきの駅","学園前駅","豊平公園駅","美園駅","月寒中央駅","福住駅"];break;
      case "札幌市電山鼻線":item = ["西４丁目駅","西８丁目駅","中央区役所前駅","西１５丁目駅","西線６条駅","西線９条旭山公園通駅","西線１１条駅","西線１４条駅","西線１６条駅","ロープウェイ入口駅","電車事業所前駅","中央図書館前駅","石山通駅","東屯田通駅","幌南小学校前駅","山鼻１９条駅","静修学園前駅","行啓通駅","中島公園通駅","山鼻９条駅","東本願寺前駅","資生館小学校前駅","すすきの駅","狸小路駅"];break;
      case "函館市電２系統":item = ["湯の川駅","湯の川温泉駅","函館アリーナ前駅","駒場車庫前駅","競馬場前駅","深堀町駅","柏木町駅","杉並町駅","五稜郭公園前駅","中央病院前駅","千代台駅","堀川町駅","昭和橋駅","千歳町駅","新川町駅","松風町駅","函館駅前駅","市役所前駅","魚市場通駅","十字街駅","宝来町駅","青柳町駅","谷地頭駅",];break;
      case "函館市電５系統":item = ["湯の川駅","湯の川温泉駅","函館アリーナ前駅","駒場車庫前駅","競馬場前駅","深堀町駅","柏木町駅","杉並町駅","五稜郭公園前駅","中央病院前駅","千代台駅","堀川町駅","昭和橋駅","千歳町駅","新川町駅","松風町駅","函館駅前駅","市役所前駅","魚市場通駅","十字街駅","末広町駅","大町駅","函館どつく前駅"];break;
      //
      case "JR海峡線":item = ["中小国駅","津軽今別駅","木古内駅"];break;
      case "JR奥羽本線(新庄〜青森)":item = ["新庄駅","泉田駅","羽前豊里駅","真室川駅","釜淵駅","大滝駅","及位駅","院内駅","横堀駅","三関駅","上湯沢駅","湯沢駅","下湯沢駅","十文字駅","醍醐駅","柳田駅","横手駅","後三年駅","飯詰駅","大曲駅","神宮寺駅","刈和野駅","峰吉川駅","羽後境駅","大張野駅","和田駅","四ツ小屋駅","秋田駅","泉外旭川駅","土崎駅","上飯島駅","追分駅","大久保駅","羽後飯塚駅","井川さくら駅","八郎潟駅","鯉川駅","鹿渡駅","森岳駅","北金岡駅","東能代駅","鶴形駅","富根駅","二ツ井駅","前山駅","鷹ノ巣駅","糠沢駅","早口駅","下川沿駅","大館駅","白沢駅","陣場駅","津軽湯の沢駅","碇ケ関駅","長峰駅","大鰐温泉駅","石川駅","弘前駅","撫牛子駅","川部駅","北常盤駅","浪岡駅","大釈迦駅","鶴ケ坂駅","津軽新城駅","新青森駅","青森駅"];break;
      case "JR大湊線(はまなすベイライン大湊線)":item = ["野辺地駅","北野辺地駅","有戸駅","吹越駅","陸奥横浜駅","有畑駅","近川駅","金谷沢駅","赤川駅","下北駅","大湊駅"];break;
      case "JR五能線":item = ["東能代駅","能代駅","向能代駅","北能代駅","鳥形駅","沢目駅","東八森駅","八森駅","滝ノ間駅","あきた白神駅","岩館駅","大間越駅","白神岳登山口駅","松神駅","十二湖駅","陸奥岩崎駅","陸奥沢辺駅","ウェスパ椿山駅","艫作駅","横磯駅","深浦駅","広戸駅","追良瀬駅","驫木駅","風合瀬駅","大戸瀬駅","千畳敷駅","北金ケ沢駅","陸奥柳田駅","陸奥赤石駅","鰺ケ沢駅","鳴沢駅","越水駅","陸奥森田駅","中田駅","木造駅","五所川原駅","陸奥鶴田駅","鶴泊駅","板柳駅","林崎駅","藤崎駅","川部駅"];break;
      case "JR津軽線":item = ["青森駅","油川駅","津軽宮田駅","奥内駅","左堰駅","後潟駅","中沢駅","蓬田駅","郷沢駅","瀬辺地駅","蟹田駅","中小国駅","大平駅","津軽二股駅","大川平駅","今別駅","津軽浜名駅","三厩駅"];break;
      case "JR八戸線":item = ["八戸駅","長苗代駅","本八戸駅","小中野駅","陸奥湊駅","白銀駅","鮫駅","陸奥白浜駅","種差海岸駅","大久喜駅","金浜駅","大蛇駅","階上駅","角の浜駅","平内駅","種市駅","玉川駅","宿戸駅","陸中八木駅","有家駅","陸中中野駅","侍浜駅","陸中夏井駅","久慈駅"];break;
      case "津軽鉄道":item = ["津軽五所川原駅","十川駅","五農校前駅","津軽飯詰駅","毘沙門駅","嘉瀬駅","金木駅","芦野公園駅","川倉駅","大沢内駅","深郷田駅","津軽中里駅"];break;
      case "弘南鉄道弘南線":item = ["弘前駅","弘前東高前駅","運動公園前駅","新里駅","館田駅","平賀駅","柏農高校前駅","津軽尾上駅","尾上高校前駅","田んぼアート駅","田舎館駅","境松駅","黒石駅"];break;
      case "弘南鉄道大鰐線":item = ["大鰐駅","宿川原駅","鯖石駅","石川プール前駅","石川駅","義塾高校前駅","津軽大沢駅","松木平駅","小栗山駅","千年駅","聖愛中高前駅","弘前学院大前駅","弘高下駅","中央弘前駅"];break;
      case "いわて銀河鉄道":item = ["盛岡駅","青山駅","厨川駅","巣子駅","滝沢駅","渋民駅","好摩駅","岩手川口駅","いわて沼宮内駅","御堂駅","奥中山高原駅","小繋駅","小鳥谷駅","一戸駅","二戸駅","斗米駅","金田一温泉駅","目時駅"];break;
      case "青い森鉄道":item = ["目時駅","三戸駅","諏訪ノ平駅","剣吉駅","苫米地駅","北高岩駅","八戸駅","陸奥市川駅","下田駅","向山駅","三沢駅","小川原駅","上北町駅","乙供駅","千曳駅","野辺地駅","狩場沢駅","清水川駅","小湊駅","西平内駅","浅虫温泉駅","野内駅","矢田前駅","小柳駅","東青森駅","筒井駅","青森駅"];break;
      //
      case '岩手県':item = ["","",""];break;
      case "JR東北本線(黒磯〜利府・盛岡)":item = ["黒磯駅","高久駅","黒田原駅","豊原駅","白坂駅","新白河駅","白河駅","久田野駅","泉崎駅","矢吹駅","鏡石駅","須賀川駅","安積永盛駅","郡山駅","日和田駅","五百川駅","本宮駅","杉田駅","二本松駅","安達駅","松川駅","金谷川駅","南福島駅","福島駅","東福島駅","伊達駅","桑折駅","藤田駅","貝田駅","越河駅","白石駅","東白石駅","北白川駅","大河原駅","船岡駅","槻木駅","岩沼駅","館腰駅","名取駅","南仙台駅","太子堂駅","長町駅","仙台駅","東仙台駅","岩切駅","新利府駅","利府駅","陸前山王駅","国府多賀城駅","塩釜駅","松島駅","愛宕駅","品井沼駅","鹿島台駅","松山町駅","小牛田駅","田尻駅","瀬峰駅","梅ケ沢駅","新田駅","石越駅","油島駅","花泉駅","清水原駅","有壁駅","一ノ関駅","山ノ目駅","平泉駅","前沢駅","陸中折居駅","水沢駅","金ケ崎駅","六原駅","北上駅","村崎野駅","花巻駅","花巻空港駅","石鳥谷駅","日詰駅","紫波中央駅","古館駅","矢幅駅","岩手飯岡駅","仙北町駅","盛岡駅"];break;
      case "JR北上線":item = ["北上駅","柳原駅","江釣子駅","藤根駅","立川目駅","横川目駅","岩沢駅","和賀仙人駅","ゆだ錦秋湖駅","ほっとゆだ駅","ゆだ高原駅","黒沢駅","小松川駅","平石駅","相野々駅","矢美津駅","横手駅"];break;
      case "JR釜石線(銀河ドリームライン釜石線)":item = ["花巻駅","似内駅","新花巻駅","小山田駅","土沢駅","晴山駅","岩根橋駅","宮守駅","柏木平駅","鱒沢駅","荒谷前駅","岩手二日町駅","綾織駅","遠野駅","青笹駅","岩手上郷駅","平倉駅","足ケ瀬駅","上有住駅","陸中大橋駅","洞泉駅","松倉駅","小佐野駅","釜石駅"];break;
      case "JR大船渡線(ドラゴンレール大船渡線)":item = ["一ノ関駅","真滝駅","陸中門崎駅","岩ノ下駅","陸中松川駅","猊鼻渓駅","柴宿駅","摺沢駅","千厩駅","小梨駅","矢越駅","折壁駅","新月駅","気仙沼駅"];break;
      case "JR田沢湖線":item = ["盛岡駅","大釜駅","小岩井駅","雫石駅","春木場駅","赤渕駅","田沢湖駅","刺巻駅","神代駅","生田駅","角館駅","鶯野駅","羽後長野駅","鑓見内駅","羽後四ツ屋駅","北大曲駅","大曲駅"];break;
      case "JR花輪線(十和田八幡平四季彩ライン)":item = ["好摩駅","東大更駅","大更駅","平館駅","北森駅","松尾八幡平駅","安比高原駅","赤坂田駅","小屋の畑駅","荒屋新町駅","横間駅","田山駅","兄畑駅","湯瀬温泉駅","八幡平駅","陸中大里駅","鹿角花輪駅","柴平駅","十和田南駅","末広駅","土深井駅","沢尻駅","十二所駅","大滝温泉駅","扇田駅","東大館駅","大館駅"];break;
      case "JR山田線":item = ["盛岡駅","上盛岡駅","山岸駅","上米内駅","区界駅","松草駅","平津戸駅","川内駅","箱石駅","陸中川井駅","腹帯駅","茂市駅","蟇目駅","花原市駅","千徳駅","宮古駅"];break;
      case "いわて銀河鉄道":item = ["盛岡駅","青山駅","厨川駅","巣子駅","滝沢駅","渋民駅","好摩駅","岩手川口駅","いわて沼宮内駅","御堂駅","奥中山高原駅","小繋駅","小鳥谷駅","一戸駅","二戸駅","斗米駅","金田一温泉駅","目時駅"];break;
      case "三陸鉄道リアス線":item = ["盛駅","陸前赤崎駅","綾里駅","恋し浜駅","甫嶺駅","三陸駅","吉浜駅","唐丹駅","平田駅","釜石駅","両石駅","鵜住居駅","大槌駅","吉里吉里駅","浪板海岸駅","岩手船越駅","織笠駅","陸中山田駅","豊間根駅","払川駅","津軽石駅","八木沢・宮古短大駅","磯鶏駅","宮古駅","山口団地駅","一の渡駅","佐羽根駅","田老駅","新田老駅","摂待駅","岩泉小本駅","島越駅","田野畑駅","普代駅","白井海岸駅","堀内駅","野田玉川駅","十府ヶ浦海岸駅","陸中野田駅","陸中宇部駅","久慈駅"];break;
    //
      case '秋田県':item = ["","","","","","","",""];break;
      case "JR花輪線(十和田八幡平四季彩ライン)":item = ["好摩駅","東大更駅","大更駅","平館駅","北森駅","松尾八幡平駅","安比高原駅","赤坂田駅","小屋の畑駅","荒屋新町駅","横間駅","田山駅","兄畑駅","湯瀬温泉駅","八幡平駅","陸中大里駅","鹿角花輪駅","柴平駅","十和田南駅","末広駅","土深井駅","沢尻駅","十二所駅","大滝温泉駅","扇田駅","東大館駅","大館駅"];break;
      case "JR羽越本線":item = ["新津駅","京ケ瀬駅","水原駅","神山駅","月岡駅","中浦駅","新発田駅","加治駅","金塚駅","中条駅","平木田駅","坂町駅","平林駅","岩船町駅","村上駅","間島駅","越後早川駅","桑川駅","今川駅","越後寒川駅","勝木駅","府屋駅","鼠ケ関駅","小岩川駅","あつみ温泉駅","五十川駅","小波渡駅","三瀬駅","羽前水沢駅","羽前大山駅","鶴岡駅","藤島駅","西袋駅","余目駅","北余目駅","砂越駅","東酒田駅","酒田駅","本楯駅","南鳥海駅","遊佐駅","吹浦駅","女鹿駅","小砂川駅","上浜駅","象潟駅","金浦駅","仁賀保駅","西目駅","羽後本荘駅","羽後岩谷駅","折渡駅","羽後亀田駅","岩城みなと駅","道川駅","下浜駅","桂根駅","新屋駅","羽後牛島駅","秋田駅"];break;
      case "JR男鹿線":item = ["追分駅","出戸浜駅","上二田駅","二田駅","天王駅","船越駅","脇本駅","羽立駅","男鹿駅"];break;
      case "秋田内陸線":item = ["鷹巣駅","西鷹巣駅","縄文小ヶ田駅","大野台駅","合川駅","上杉駅","米内沢駅","桂瀬駅","阿仁前田温泉駅","前田南駅","小渕駅","阿仁合駅","荒瀬駅","萱草駅","笑内駅","岩野目駅","比立内駅","奥阿仁駅","阿仁マタギ駅","戸沢駅","上桧木内駅","左通駅","羽後中里駅","松葉駅","羽後長戸呂駅","八津駅","西明寺駅","羽後太田駅","角館駅"];break;
      case "由利高原鉄道":item = ["羽後本荘駅","薬師堂駅","子吉駅","鮎川駅","黒沢駅","曲沢駅","前郷駅","久保田駅","西滝沢駅","吉沢駅","川辺駅","矢島駅"];break;
//
      case '宮城県':item = ["","","","","","","","",""];break;
      case "JR仙山線":item = ["仙台駅","東照宮駅","北仙台駅","北山駅","東北福祉大前駅","国見駅","葛岡駅","陸前落合駅","愛子駅","陸前白沢駅","熊ケ根駅","作並駅","奥新川駅","面白山高原駅","山寺駅","高瀬駅","楯山駅","羽前千歳駅","北山形駅","山形駅"];break;
      case "JR石巻線":item = ["小牛田駅","上涌谷駅","涌谷駅","前谷地駅","佳景山駅","鹿又駅","曽波神駅","石巻駅","陸前稲井駅","渡波駅","万石浦駅","沢田駅","浦宿駅","女川駅"];break;
      case "JR仙石線":item = ["あおば通駅","仙台駅","榴ケ岡駅","宮城野原駅","陸前原ノ町駅","苦竹駅","小鶴新田駅","福田町駅","陸前高砂駅","中野栄駅","多賀城駅","下馬駅","西塩釜駅","本塩釜駅","東塩釜駅","陸前浜田駅","松島海岸駅","高城町駅","手樽駅","陸前富山駅","陸前大塚駅","東名駅","野蒜駅","陸前小野駅","鹿妻駅","矢本駅","東矢本駅","陸前赤井駅","石巻あゆみ野駅","蛇田駅","陸前山下駅","石巻駅"];break;
      case "JR陸羽東線(奥の細道湯けむりライン)":item = ["小牛田駅","北浦駅","陸前谷地駅","古川駅","塚目駅","西古川駅","東大崎駅","西大崎駅","岩出山駅","有備館駅","上野目駅","池月駅","川渡温泉駅","鳴子御殿湯駅","鳴子温泉駅","中山平温泉駅","堺田駅","赤倉温泉駅","立小路駅","最上駅","大堀駅","鵜杉駅","瀬見温泉駅","東長沢駅","長沢駅","南新庄駅","新庄駅"];break;
      case "JR気仙沼線":item = ["前谷地駅","和渕駅","のの岳駅","陸前豊里駅","御岳堂駅","柳津駅"];break;
      case "JR常磐線(いわき〜仙台)":item = ["いわき駅","草野駅","四ツ倉駅","久ノ浜駅","末続駅","広野駅","Jヴィレッジ駅","木戸駅","竜田駅","富岡駅","夜ノ森駅","大野駅","双葉駅","浪江駅","桃内駅","小高駅","磐城太田駅","原ノ町駅","鹿島駅","日立木駅","相馬駅","駒ケ嶺駅","新地駅","坂元駅","山下駅","浜吉田駅","亘理駅","逢隈駅","岩沼駅","館腰駅","名取駅","南仙台駅","太子堂駅","長町駅","仙台駅"];break;
      case "阿武隈急行":item = ["福島駅","卸町駅","福島学院前駅","瀬上駅","向瀬上駅","高子駅","上保原駅","保原駅","大泉駅","二井田駅","新田駅","梁川駅","やながわ希望の森公園前駅","富野駅","兜駅","あぶくま駅","丸森駅","北丸森駅","南角田駅","角田駅","横倉駅","岡駅","東船岡駅","槻木駅"];break;
      case "仙台市営地下鉄南北線":item = ["泉中央駅","八乙女駅","黒松駅","旭ヶ丘駅","台原駅","北仙台駅","北四番丁駅","勾当台公園駅","広瀬通駅","仙台駅","五橋駅","愛宕橋駅","河原町駅","長町一丁目駅","長町駅","長町南駅","富沢駅"];break;
      case "仙台市営地下鉄東西線":item = ["八木山動物公園駅","青葉山駅","川内駅","国際センター駅","大町西公園駅","青葉通一番町駅","仙台駅","宮城野通駅","連坊駅","薬師堂駅","卸町駅","六丁の目駅","荒井駅"];break;
      case "仙台空港線":item = ["名取駅","杜せきのした駅","美田園駅","仙台空港駅"];break;
//
      case '山形県':item = ["","","","","",""];break;
      case "JR羽越本線":item = ["新津駅","京ケ瀬駅","水原駅","神山駅","月岡駅","中浦駅","新発田駅","加治駅","金塚駅","中条駅","平木田駅","坂町駅","平林駅","岩船町駅","村上駅","間島駅","越後早川駅","桑川駅","今川駅","越後寒川駅","勝木駅","府屋駅","鼠ケ関駅","小岩川駅","あつみ温泉駅","五十川駅","小波渡駅","三瀬駅","羽前水沢駅","羽前大山駅","鶴岡駅","藤島駅","西袋駅","余目駅","北余目駅","砂越駅","東酒田駅","酒田駅","本楯駅","南鳥海駅","遊佐駅","吹浦駅","女鹿駅","小砂川駅","上浜駅","象潟駅","仁賀保駅","西目駅","羽後本荘駅","羽後岩谷駅","折渡駅","羽後亀田駅","岩城みなと駅","道川駅","下浜駅","桂根駅","新屋駅","羽後牛島駅","秋田駅"];break;
      case "JR奥羽本線(山形線)":item = ["福島駅","笹木野駅","庭坂駅","板谷駅","峠駅","大沢駅","関根駅","米沢駅","置賜駅","高畠駅","赤湯駅","中川駅","羽前中山駅","かみのやま温泉駅","茂吉記念館前駅","蔵王駅","山形駅","北山形駅","羽前千歳駅","南出羽駅","漆山駅","高擶駅","天童南駅","天童駅","乱川駅","神町駅","さくらんぼ東根駅","東根駅","村山駅","袖崎駅","大石田駅","北大石田駅","芦沢駅","舟形駅","新庄駅"];break;
      case "JR左沢線(フルーツライン左沢線)":item = ["山形駅","北山形駅","東金井駅","羽前山辺駅","羽前金沢駅","羽前長崎駅","南寒河江駅","寒河江駅","西寒河江駅","羽前高松駅","柴橋駅","左沢駅"];break;
      case "JR米坂線":item = ["米沢駅","南米沢駅","西米沢駅","成島駅","中郡駅","羽前小松駅","犬川駅","今泉駅","萩生駅","羽前椿駅","手ノ子駅","羽前沼沢駅","伊佐領駅","羽前松岡駅","小国駅","越後金丸駅","越後片貝駅","越後下関駅","越後大島駅","坂町駅"];break;
      case "JR陸羽西線(奥の細道最上川ライン)":item = ["新庄駅","升形駅","羽前前波駅","津谷駅","古口駅","高屋駅","清川駅","狩川駅","南野駅","余目駅"];break;
      case "山形鉄道フラワー長井線":item = ["赤湯駅","南陽市役所駅","宮内駅","おりはた駅","梨郷駅","西大塚駅","今泉駅","時庭駅","南長井駅","長井駅","あやめ公園駅","羽前成田駅","白兎駅","蚕桑駅","鮎貝駅","四季の郷駅","荒砥駅"];break;
     //
      case '福島県':item = ["","","","","","","","","",""];break;
      case "JR磐越西線(郡山〜会津若松)":item = ["郡山駅","郡山富田駅","喜久田駅","安子ケ島駅","磐梯熱海駅","中山宿駅","上戸駅","猪苗代湖畔駅","関都駅","川桁駅","猪苗代駅","翁島駅","磐梯町駅","東長原駅","広田駅","会津若松駅"];break;
      case "JR磐越西線(森と水とロマンの鉄道)":item = ["会津若松駅","堂島駅","笈川駅","塩川駅","姥堂駅","会津豊川駅","喜多方駅","山都駅","荻野駅","尾登駅","野沢駅","上野尻駅","徳沢駅","豊実駅","日出谷駅","鹿瀬駅","津川駅","三川駅","五十島駅","東下条駅","咲花駅","馬下駅","猿和田駅","五泉駅","北五泉駅","新関駅","東新津駅","新津駅"];break;
      case "JR只見線":item = ["会津若松駅","七日町駅","西若松駅","会津本郷駅","会津高田駅","根岸駅","新鶴駅","若宮駅","会津坂下駅","塔寺駅","会津坂本駅","会津柳津駅","郷戸駅","滝谷駅","会津桧原駅","会津西方駅","会津宮下駅","早戸駅","会津水沼駅","会津中川駅","会津川口駅","本名駅","会津越川駅","会津横田駅","会津大塩駅","会津塩沢駅","会津蒲生駅","只見駅","大白川駅","入広瀬駅","上条駅","越後須原駅","魚沼田中駅","越後広瀬駅","藪神駅","小出駅"];break;
      case "JR磐越東線(ゆうゆうあぶくまライン)":item = ["いわき駅","赤井駅","小川郷駅","江田駅","川前駅","夏井駅","小野新町駅","神俣駅","菅谷駅","大越駅","磐城常葉駅","船引駅","要田駅","三春駅","舞木駅","郡山駅"];break;
      case "JR水郡線":item = ["水戸駅","常陸青柳駅","常陸津田駅","後台駅","下菅谷駅","中菅谷駅","上菅谷駅","南酒出駅","額田駅","河合駅","谷河原駅","常陸太田駅","常陸鴻巣駅","瓜連駅","静駅","常陸大宮駅","玉川村駅","野上原駅","山方宿駅","中舟生駅","下小川駅","西金駅","上小川駅","袋田駅","常陸大子駅","下野宮駅","矢祭山駅","東館駅","南石井駅","磐城石井駅","磐城塙駅","近津駅","中豊駅","磐城棚倉駅","磐城浅川駅","里白石駅","磐城石川駅","野木沢駅","川辺沖駅","泉郷駅","川東駅","小塩江駅","谷田川駅","磐城守山駅","安積永盛駅","郡山駅"];break;
      case "JR常磐線(取手〜いわき)":item = ["取手駅","藤代駅","龍ケ崎市駅","牛久駅","ひたち野うしく駅","荒川沖駅","土浦駅","神立駅","高浜駅","石岡駅","羽鳥駅","岩間駅","友部駅","内原駅","赤塚駅","偕楽園駅","水戸駅","勝田駅","佐和駅","東海駅","大甕駅","常陸多賀駅","日立駅","小木津駅","十王駅","高萩駅","南中郷駅","磯原駅","大津港駅","勿来駅","植田駅","泉駅","湯本駅","内郷駅","いわき駅"];break;
      case "福島交通飯坂線":item = ["福島駅","曽根田駅","美術館図書館前駅","岩代清水駅","泉駅","上松川駅","笹谷駅","桜水駅","平野駅","医王寺前駅","花水坂駅","飯坂温泉駅"];break;
      case "会津鉄道":item = ["西若松駅","南若松駅","門田駅","あまや駅","芦ノ牧温泉駅","大川ダム公園駅","芦ノ牧温泉南駅","湯野上温泉駅","塔のへつり駅","弥五島駅","会津下郷駅","ふるさと公園駅","養鱒公園駅","会津長野駅","田島高校前駅","会津田島駅","中荒井駅","会津荒海駅","会津山村道場駅","七ヶ岳登山口駅","会津高原尾瀬口駅"];break;
      case "野岩鉄道会津鬼怒川線":item = ["新藤原駅","龍王峡駅","川治温泉駅","川治湯元駅","湯西川温泉駅","中三依温泉駅","上三依塩原温泉口駅","男鹿高原駅","会津高原尾瀬口駅"];break;
     //
      case '新潟県':item = ["","","","","","","","","",""];break;
      case "JR上越線":item = ["高崎駅","高崎問屋町駅","井野駅","新前橋駅","群馬総社駅","八木原駅","渋川駅","敷島駅","津久田駅","岩本駅","沼田駅","後閑駅","上牧駅","水上駅","湯檜曽駅","土合駅","土樽駅","越後中里駅","岩原スキー場前駅","越後湯沢駅","石打駅","大沢駅","上越国際スキー場前駅","塩沢駅","六日町駅","五日町駅","浦佐駅","八色駅","小出駅","越後堀之内駅","北堀之内駅","越後川口駅","小千谷駅","越後滝谷駅","宮内駅","長岡駅"];break;
      case "JR信越本線(直江津〜新潟)":item = ["直江津駅","黒井駅","犀潟駅","土底浜駅","潟町駅","上下浜駅","柿崎駅","米山駅","笠島駅","青海川駅","鯨波駅","柏崎駅","茨目駅","安田駅","北条駅","越後広田駅","長鳥駅","塚山駅","越後岩塚駅","来迎寺駅","前川駅","宮内駅","長岡駅","北長岡駅","押切駅","見附駅","帯織駅","東光寺駅","三条駅","東三条駅","保内駅","加茂駅","羽生田駅","田上駅","矢代田駅","古津駅","新津駅","さつき野駅","荻川駅","亀田駅","越後石山駅","新潟駅"];break;
      case "JR北陸本線(富山〜直江津)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR白新線":item = ["新潟駅","東新潟駅","大形駅","新崎駅","早通駅","豊栄駅","黒山駅","佐々木駅","西新発田駅","新発田駅"];break;
      case "JR越後線":item = ["柏崎駅","東柏崎駅","西中通駅","荒浜駅","刈羽駅","西山駅","礼拝駅","石地駅","小木ノ城駅","出雲崎駅","妙法寺駅","小島谷駅","桐原駅","寺泊駅","分水駅","粟生津駅","南吉田駅","吉田駅","北吉田駅","岩室駅","巻駅","越後曽根駅","越後赤塚駅","内野西が丘駅","内野駅","新潟大学前駅","寺尾駅","小針駅","青山駅","関屋駅","白山駅","新潟駅"];break;
      case "JR飯山線":item = ["長野駅","北長野駅","三才駅","豊野駅","信濃浅野駅","立ケ花駅","上今井駅","替佐駅","蓮駅","飯山駅","北飯山駅","信濃平駅","戸狩野沢温泉駅","上境駅","上桑名川駅","桑名川駅","西大滝駅","信濃白鳥駅","平滝駅","横倉駅","森宮野原駅","足滝駅","越後田中駅","津南駅","越後鹿渡駅","越後田沢駅","越後水沢駅","土市駅","十日町駅","魚沼中条駅","下条駅","越後岩沢駅","内ケ巻駅","越後川口駅"];break;
      case "JR弥彦線":item = ["弥彦駅","矢作駅","吉田駅","西燕駅","燕駅","燕三条駅","北三条駅","東三条駅"];break;
      case "北越急行ほくほく線":item = ["六日町駅","魚沼丘陵駅","美佐島駅","しんざ駅","十日町駅","まつだい駅","ほくほく大島駅","虫川大杉駅","うらがわら駅","大池いこいの森駅","くびき駅","犀潟駅"];break;
      case '日本海ひすいライン':item = ["直江津駅","谷浜駅","有間川駅","名立駅","筒石駅","能生駅","浦本駅","梶屋敷駅","えちご押上ひすい海岸駅","糸魚川駅","青海駅","親不知駅","市振駅"];break;
      case "北アルプス線":item = ["松本駅","北松本駅","島内駅","島高松駅","梓橋駅","一日市場駅","中萱駅","南豊科駅","豊科駅","柏矢町駅","穂高駅","有明駅","安曇追分駅","細野駅","北細野駅","信濃松川駅","安曇沓掛駅","信濃常盤駅","南大町駅","信濃大町駅","北大町駅","信濃木崎駅","稲尾駅","海ノ口駅","簗場駅","南神城駅","神城駅","飯森駅","白馬駅","信濃森上駅","白馬大池駅","千国駅","南小谷駅","中土駅","北小谷駅","平岩駅","小滝駅","根知駅","頸城大野駅","姫川駅","糸魚川駅"];break;
      case '妙高はねうまライン':item = ["直江津駅","春日山駅","高田駅","南高田駅","上越妙高駅","北新井駅","新井駅","二本木駅","関山駅","妙高高原駅"];break;
      case "あいの風とやま鉄道線":item = ["倶利伽羅駅","石動駅","福岡駅","西高岡駅","高岡やぶなみ駅","高岡駅","越中大門駅","小杉駅","呉羽駅","富山駅","東富山駅","水橋駅","滑川駅","東滑川駅","魚津駅","黒部駅","生地駅","西入善駅","入善駅","泊駅","越中宮崎駅","市振駅"];break;
      case '北しなの線':item = ["長野駅","北長野駅","三才駅","豊野駅","牟礼駅","古間駅","黒姫駅","妙高高原駅"];break;

    //
      case '富山県':item = ["","","","","","","","","",""];break;
      case "JR北陸本線(米原〜富山)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR高山本線":item = ["岐阜駅","長森駅","那加駅","蘇原駅","各務ケ原駅","鵜沼駅","坂祝駅","美濃太田駅","古井駅","中川辺駅","下麻生駅","上麻生駅","白川口駅","下油井駅","飛騨金山駅","焼石駅","下呂駅","禅昌寺駅","飛騨萩原駅","上呂駅","飛騨宮田駅","飛騨小坂駅","渚駅","久々野駅","飛騨一ノ宮駅","高山駅","上枝駅","飛騨国府駅","飛騨古川駅","杉崎駅","飛騨細江駅","角川駅","坂上駅","打保駅","杉原駅","猪谷駅","楡原駅","笹津駅","東八尾駅","越中八尾駅","千里駅","速星駅","婦中鵜坂駅","西富山駅","富山駅"];break;
      case "JR氷見線":item = ["高岡駅","越中中川駅","能町駅","伏木駅","越中国分駅","雨晴駅","島尾駅","氷見駅"];break;
      case "JR城端線":item = ["高岡駅","新高岡駅","二塚駅","林駅","戸出駅","油田駅","砺波駅","東野尻駅","高儀駅","福野駅","東石黒駅","福光駅","越中山田駅","城端駅"];break;
      case "富山地鉄本線":item = ["電鉄富山駅","稲荷町駅","新庄田中駅","東新庄駅","越中荏原駅","越中三郷駅","越中舟橋駅","寺田駅","越中泉駅","相ノ木駅","新相ノ木駅","上市駅","新宮川駅","中加積駅","西加積駅","西滑川駅","中滑川駅","滑川駅","浜加積駅","早月加積駅","越中中村駅","西魚津駅","電鉄魚津駅","新魚津駅","経田駅","電鉄石田駅","電鉄黒部駅","東三日市駅","荻生駅","長屋駅","新黒部駅","舌山駅","若栗駅","栃屋駅","浦山駅","下立口駅","下立駅","愛本駅","内山駅","音沢駅","宇奈月温泉駅"];break;
      case "富山地鉄立山線":item = ["寺田駅","稚子塚駅","田添駅","五百石駅","榎町駅","下段駅","釜ヶ淵駅","沢中山駅","岩峅寺駅","横江駅","千垣駅","有峰口駅","本宮駅","立山駅"];break;
      case "富山地鉄不二越・上滝線":item = ["電鉄富山駅","稲荷町駅","栄町駅","不二越駅","大泉駅","南富山駅","朝菜町駅","上堀駅","小杉駅","布市駅","開発駅","月岡駅","大庄駅","上滝駅","大川寺駅","岩峅寺駅"];break;
      case "富山地鉄市内線":item = ["南富山駅前駅","大町駅","堀川小泉駅","小泉町駅","西中野駅","広貫堂前駅","上本町駅","西町駅","中町（西町北）駅","荒町駅","桜橋駅","電気ビル前駅","地鉄ビル前駅","電鉄富山駅・エスタ前駅","富山駅","新富町駅","県庁前駅","丸の内駅","諏訪川原駅","安野屋駅","トヨタモビリティ富山 Gスクエア五福前駅","富山大学前駅"];break;
      case "黒部峡谷鉄道":item = ["宇奈月駅","黒薙駅","鐘釣駅","欅平駅"];break;
      case "万葉線":item = ["高岡駅","末広町駅","片原町駅","坂下町駅","急患医療センター前駅","広小路駅","志貴野中学校前駅","市民病院前駅","江尻駅","旭ヶ丘駅","荻布駅","新能町駅","米島口駅","能町口駅","新吉久駅","吉久駅","中伏木駅","六渡寺駅","庄川口駅","西新湊駅","新町口駅","中新湊駅","東新湊駅","海王丸駅","越ノ潟駅"];break;
      case "富山港線":item = ["富山駅","オークスカナルパークホテル富山前駅","インテック本社前駅","龍谷富山高校前（永楽町）駅","奥田中学校前駅","下奥井駅","粟島（大阪屋ショップ前）駅","越中中島駅","城川原駅","犬島新町駅","蓮町（馬場記念公園前）駅","萩浦小学校前駅","東岩瀬駅","競輪場前駅","岩瀬浜駅"];break;
      case "富山地鉄富山都心線【３系統(環状線)":item = ["丸の内駅","国際会議場前駅","大手モール駅","グランドプラザ前駅","中町（西町北）駅","荒町駅","桜橋駅","電気ビル前駅","地鉄ビル前駅","電鉄富山駅・エスタ前駅","富山駅","新富町駅","県庁前駅"];break;
    //
      case '石川県':item = ["","","",""];break;
      case "JR七尾線":item = ["津幡駅","中津幡駅","本津幡駅","能瀬駅","宇野気駅","横山駅","高松駅","免田駅","宝達駅","敷浪駅","南羽咋駅","羽咋駅","千路駅","金丸駅","能登部駅","良川駅","能登二宮駅","徳田駅","七尾駅","和倉温泉駅"];break;
      case "北陸鉄道石川線":item = ["野町駅","西泉駅","新西金沢駅","押野駅","野々市駅","野々市工大前駅","馬替駅","額住宅前駅","乙丸駅","四十万駅","陽羽里駅","曽谷駅","道法寺駅","井口駅","小柳駅","日御子駅","鶴来駅"];break;
      case "北陸鉄道浅野川線":item = ["北鉄金沢駅","七ツ屋駅","上諸江駅","磯部駅","割出駅","三口駅","三ツ屋駅","大河端駅","北間駅","蚊爪駅","粟ヶ崎駅","内灘駅"];break;
      case "のと鉄道七尾線":item = ["七尾駅","和倉温泉駅","田鶴浜駅","笠師保駅","能登中島駅","西岸駅","能登鹿島駅","穴水駅"];break;
      case 'IRいしかわ鉄道線':item = ["金沢駅","東金沢駅","森本駅","津幡駅","倶利伽羅駅"];break;
      case "JR北陸本線(米原～金沢)":item = ["米原駅","坂田駅","田村駅","長浜駅","虎姫駅","河毛駅","高月駅","木ノ本駅","余呉駅","近江塩津駅","新疋田駅","敦賀駅","南今庄駅","今庄駅","湯尾駅","南条駅","王子保駅","武生駅","鯖江駅","北鯖江駅","大土呂駅","越前花堂駅","福井駅","森田駅","春江駅","丸岡駅","芦原温泉駅","細呂木駅","牛ノ谷駅","大聖寺駅","加賀温泉駅","動橋駅","粟津駅","小松駅","明峰駅","能美根上駅","小舞子駅","美川駅","加賀笠間駅","松任駅","野々市駅","西金沢駅","金沢駅"];break;
    //
      case '福井県':item = ["","","","",""];break;
      case "JR越美北線(九頭竜線)":item = ["福井駅","越前花堂駅","六条駅","足羽駅","越前東郷駅","一乗谷駅","越前高田駅","市波駅","小和清水駅","美山駅","越前薬師駅","越前大宮駅","計石駅","牛ケ原駅","北大野駅","越前大野駅","越前田野駅","越前富田駅","下唯野駅","柿ケ島駅","勝原駅","越前下山駅","九頭竜湖駅"];break;
      case "JR小浜線":item = ["東舞鶴駅","松尾寺駅","青郷駅","三松駅","若狭高浜駅","若狭和田駅","若狭本郷駅","加斗駅","勢浜駅","小浜駅","東小浜駅","新平野駅","上中駅","若狭有田駅","大鳥羽駅","十村駅","藤井駅","三方駅","気山駅","美浜駅","東美浜駅","粟野駅","西敦賀駅","敦賀駅"];break;
      case "えちぜん鉄道勝山永平寺線":item = ["福井駅","新福井駅","福井口駅","越前開発駅","越前新保駅","追分口駅","東藤島駅","越前島橋駅","観音町駅","松岡駅","志比堺駅","永平寺口駅","下志比駅","光明寺駅","轟駅","越前野中駅","山王駅","越前竹原駅","小舟渡駅","保田駅","発坂駅","比島駅","勝山駅"];break;
      case "えちぜん鉄道三国芦原線":item = ["福井駅","新福井駅","福井口駅","まつもと町屋駅","西別院駅","田原町駅","福大前西福井駅","日華化学前駅","八ツ島駅","新田塚駅","中角駅","鷲塚針原駅","太郎丸エンゼルランド駅","西春江ハートピア駅","西長田ゆりの里駅","下兵庫こうふく駅","大関駅","本荘駅","番田駅","あわら湯のまち駅","水居駅","三国神社駅","三国駅","三国港駅"];break;
      case "福井鉄道福武線":item = ["越前武生駅","北府駅","スポーツ公園駅","家久駅","サンドーム西駅","西鯖江駅","西山公園駅","水落駅","神明駅","鳥羽中駅","三十八社駅","泰澄の里駅","浅水駅","ハーモニーホール駅","清明駅","江端駅","ベル前駅","花堂駅","赤十字前駅","商工会議所前駅","足羽山公園口駅","福井城址大名町駅","福井駅","仁愛女子高校駅","田原町駅"];break;
//
      case '山梨県':item = ["","","",""];break;
      case "JR中央本線(東京〜塩尻)":item = ["東京駅","四ツ谷駅","新宿駅","吉祥寺駅","三鷹駅","国分寺駅","立川駅","日野駅","豊田駅","八王子駅","西八王子駅","高尾駅","相模湖駅","藤野駅","上野原駅","四方津駅","梁川駅","鳥沢駅","猿橋駅","大月駅","初狩駅","笹子駅","甲斐大和駅","勝沼ぶどう郷駅","塩山駅","東山梨駅","山梨市駅","春日居町駅","石和温泉駅","酒折駅","甲府駅","竜王駅","塩崎駅","韮崎駅","新府駅","穴山駅","日野春駅","長坂駅","小淵沢駅","信濃境駅","富士見駅","すずらんの里駅","青柳駅","茅野駅","上諏訪駅","下諏訪駅","岡谷駅","みどり湖駅","川岸駅","辰野駅","信濃川島駅","小野駅","塩尻駅"];break;
      case "JR小海線(八ヶ岳高原線)":item = ["小淵沢駅","甲斐小泉駅","甲斐大泉駅","清里駅","野辺山駅","信濃川上駅","佐久広瀬駅","佐久海ノ口駅","海尻駅","松原湖駅","小海駅","馬流駅","高岩駅","八千穂駅","海瀬駅","羽黒下駅","青沼駅","臼田駅","龍岡城駅","太田部駅","中込駅","滑津駅","北中込駅","岩村田駅","佐久平駅","中佐都駅","美里駅","三岡駅","乙女駅","東小諸駅","小諸駅"];break;
      case "JR身延線":item = ["富士駅","柚木駅","竪堀駅","入山瀬駅","富士根駅","源道寺駅","富士宮駅","西富士宮駅","沼久保駅","芝川駅","稲子駅","十島駅","井出駅","寄畑駅","内船駅","甲斐大島駅","身延駅","塩之沢駅","波高島駅","下部温泉駅","甲斐常葉駅","市ノ瀬駅","久那土駅","甲斐岩間駅","落居駅","鰍沢口駅","市川大門駅","市川本町駅","芦川駅","甲斐上野駅","東花輪駅","小井川駅","常永駅","国母駅","甲斐住吉駅","南甲府駅","善光寺駅","金手駅","甲府駅"];break;
      case "富士急行":item = ["大月駅","上大月駅","田野倉駅","禾生駅","赤坂駅","都留市駅","谷村町駅","都留文科大学前駅","十日市場駅","東桂駅","三つ峠駅","寿駅","葭池温泉前駅","下吉田駅","月江寺駅","富士山駅","富士急ハイランド駅","河口湖駅"];break;
     //
      case '長野県':item = ["","","","","","","","","",""];break;
      case "JR信越本線(篠ノ井〜直江津)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR中央本線(名古屋〜塩尻)":item = ["名古屋駅","金山駅","鶴舞駅","千種駅","大曽根駅","新守山駅","勝川駅","春日井駅","神領駅","高蔵寺駅","定光寺駅","古虎渓駅","多治見駅","土岐市駅","瑞浪駅","釜戸駅","武並駅","恵那駅","美乃坂本駅","中津川駅","落合川駅","坂下駅","田立駅","南木曽駅","十二兼駅","野尻駅","大桑駅","須原駅","倉本駅","上松駅","木曽福島駅","原野駅","宮ノ越駅","藪原駅","奈良井駅","木曽平沢駅","贄川駅","日出塩駅","洗馬駅","塩尻駅"];break;
      case "JR大糸線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR篠ノ井線":item = ["塩尻駅","広丘駅","村井駅","平田駅","南松本駅","松本駅","田沢駅","明科駅","西条駅","坂北駅","聖高原駅","冠着駅","姨捨駅","稲荷山駅","篠ノ井駅"];break;
      case "JR飯田線(豊橋〜天竜峡)":item = ["豊橋駅","船町駅","下地駅","小坂井駅","牛久保駅","豊川駅","三河一宮駅","長山駅","江島駅","東上駅","野田城駅","新城駅","東新町駅","茶臼山駅","三河東郷駅","大海駅","鳥居駅","長篠城駅","本長篠駅","三河大野駅","湯谷温泉駅","三河槙原駅","柿平駅","三河川合駅","池場駅","東栄駅","出馬駅","上市場駅","浦川駅","早瀬駅","下川合駅","中部天竜駅","佐久間駅","相月駅","城西駅","向市場駅","水窪駅","大嵐駅","小和田駅","中井侍駅","伊那小沢駅","鶯巣駅","平岡駅","為栗駅","温田駅","田本駅","門島駅","唐笠駅","金野駅","千代駅","天竜峡駅"];break;
      case "JR飯田線(天竜峡〜辰野)":item = ["天竜峡駅","川路駅","時又駅","駄科駅","毛賀駅","伊那八幡駅","下山村駅","鼎駅","切石駅","飯田駅","桜町駅","伊那上郷駅","元善光寺駅","下市田駅","市田駅","下平駅","山吹駅","伊那大島駅","上片桐駅","伊那田島駅","高遠原駅","七久保駅","伊那本郷駅","飯島駅","田切駅","伊那福岡駅","小町屋駅","駒ケ根駅","大田切駅","宮田駅","赤木駅","沢渡駅","下島駅","伊那市駅","伊那北駅","田畑駅","北殿駅","木ノ下駅","伊那松島駅","沢駅","羽場駅","伊那新町駅","宮木駅","辰野駅"];break;
      case "しなの鉄道":item = ["軽井沢駅","中軽井沢駅","信濃追分駅","御代田駅","平原駅","小諸駅","滋野駅","田中駅","大屋駅","信濃国分寺駅","上田駅","西上田駅","テクノさかき駅","坂城駅","戸倉駅","千曲駅","屋代駅","屋代高校前駅","篠ノ井駅","今井駅","川中島駅","安茂里駅","長野駅"];break;
      case "上田電鉄別所線":item = ["上田駅","城下駅","三好町駅","赤坂上駅","上田原駅","寺下駅","神畑駅","大学前駅","下之郷駅","中塩田駅","塩田町駅","中野駅","舞田駅","八木沢駅","別所温泉駅"];break;
      case "長野電鉄長野線":item = ["長野駅","市役所前駅","権堂駅","善光寺下駅","本郷駅","桐原駅","信濃吉田駅","朝陽駅","附属中学前駅","柳原駅","村山駅","日野駅","須坂駅","北須坂駅","小布施駅","都住駅","桜沢駅","延徳駅","信州中野駅","中野松川駅","信濃竹原駅","夜間瀬駅","上条駅","湯田中駅"];break;
      case "松本電鉄上高地線":item = ["松本駅","西松本駅","渚駅","信濃荒井駅","大庭駅","下新駅","北新・松本大学前駅","新村駅","三溝駅","森口駅","下島駅","波田駅","渕東駅","新島々駅"];break;
    //
      case '栃木県':item = ["","","","","","","","","","","","",];break;
      case "JR烏山線":item = ["宝積寺駅","下野花岡駅","仁井田駅","鴻野山駅","大金駅","小塙駅","滝駅","烏山駅"];break;
      case "JR水戸線":item = ["小山駅","小田林駅","結城駅","東結城駅","川島駅","玉戸駅","下館駅","新治駅","大和駅","岩瀬駅","羽黒駅","福原駅","稲田駅","笠間駅","宍戸駅","友部駅"];break;
      case "JR日光線":item = ["宇都宮駅","鶴田駅","鹿沼駅","文挟駅","下野大沢駅","今市駅","日光駅"];break;
      case "JR両毛線":item = ["高崎駅","高崎問屋町駅","井野駅","新前橋駅","前橋駅","前橋大島駅","駒形駅","伊勢崎駅","国定駅","岩宿駅","桐生駅","小俣駅","山前駅","足利駅","あしかがフラワーパーク駅","富田駅","佐野駅","岩舟駅","大平下駅","栃木駅","思川駅","小山駅"];break;
      case "東武伊勢崎線":item = ["浅草駅","とうきょうスカイツリー駅","押上〈スカイツリー前〉駅","曳舟駅","東向島駅","鐘ヶ淵駅","堀切駅","牛田駅","北千住駅","小菅駅","五反野駅","梅島駅","西新井駅","竹ノ塚駅","谷塚駅","草加駅","獨協大学前〈草加松原〉駅","新田駅","蒲生駅","新越谷駅","越谷駅","北越谷駅","大袋駅","せんげん台駅","武里駅","一ノ割駅","春日部駅","北春日部駅","姫宮駅","東武動物公園駅","和戸駅","久喜駅","鷲宮駅","花崎駅","加須駅","南羽生駅","羽生駅","川俣駅","茂林寺前駅","館林駅","多々良駅","県駅","福居駅","東武和泉駅","足利市駅","野州山辺駅","韮川駅","太田駅","細谷駅","木崎駅","世良田駅","境町駅","剛志駅","新伊勢崎駅","伊勢崎駅"];break;
      case "東武日光線":item = ["東武動物公園駅","杉戸高野台駅","幸手駅","南栗橋駅","栗橋駅","新古河駅","柳生駅","板倉東洋大前駅","藤岡駅","静和駅","新大平下駅","栃木駅","新栃木駅","合戦場駅","家中駅","東武金崎駅","楡木駅","樅山駅","新鹿沼駅","北鹿沼駅","板荷駅","下小代駅","明神駅","下今市駅","上今市駅","東武日光駅"];break;
      case "東武宇都宮線":item = ["栃木駅","新栃木駅","野州平川駅","野州大塚駅","壬生駅","国谷駅","おもちゃのまち駅","安塚駅","西川田駅","江曽島駅","南宇都宮駅","東武宇都宮駅"];break;
      case "東武佐野線":item = ["館林駅","渡瀬駅","田島駅","佐野市駅","佐野駅","堀米駅","吉水駅","田沼駅","多田駅","葛生駅"];break;
      case "東武鬼怒川線":item = ["下今市駅","大谷向駅","大桑駅","新高徳駅","小佐越駅","東武ワールドスクウェア駅","鬼怒川温泉駅","鬼怒川公園駅","新藤原駅"];break;
      case "わたらせ渓谷鐵道":item = ["桐生駅","下新田駅","相老駅","運動公園駅","大間々駅","上神梅駅","本宿駅","水沼駅","花輪駅","中野駅","小中駅","神戸駅","沢入駅","原向駅","通洞駅","足尾駅","間藤駅"];break;
      case "関東鉄道常総線":item = ["取手駅","西取手駅","寺原駅","新取手駅","ゆめみ野駅","稲戸井駅","戸頭駅","南守谷駅","守谷駅","新守谷駅","小絹駅","水海道駅","北水海道駅","中妻駅","三妻駅","南石下駅","石下駅","玉村駅","宗道駅","下妻駅","大宝駅","騰波ノ江駅","黒子駅","大田郷駅","下館駅"];break;
      case "真岡鐵道":item = ["下館駅","下館二高前駅","折本駅","ひぐち駅","久下田駅","寺内駅","真岡駅","北真岡駅","西田井駅","北山駅","益子駅","七井駅","多田羅駅","市塙駅","笹原田駅","天矢場駅","茂木駅"];break;
      case "宇都宮線":item = ["上野駅","尾久駅","赤羽駅","浦和駅","さいたま新都心駅","大宮駅","土呂駅","東大宮駅","蓮田駅","白岡駅","新白岡駅","久喜駅","東鷲宮駅","栗橋駅","古河駅","野木駅","間々田駅","小山駅","小金井駅","自治医大駅","石橋駅","雀宮駅","宇都宮駅","岡本駅","宝積寺駅","氏家駅","蒲須坂駅","片岡駅","矢板駅","野崎駅","西那須野駅","那須塩原駅","黒磯駅"];break;
    //
      case '群馬県':item = ["","","","","","","","",""];break;
      case "JR八高線(高麗川〜高崎)":item = ["高麗川駅","毛呂駅","越生駅","明覚駅","小川町駅","竹沢駅","折原駅","寄居駅","用土駅","松久駅","児玉駅","丹荘駅","群馬藤岡駅","北藤岡駅","倉賀野駅","高崎駅"];break;
      case "JR高崎線":item = ["上野駅","尾久駅","赤羽駅","浦和駅","さいたま新都心駅","大宮駅","宮原駅","上尾駅","北上尾駅","桶川駅","北本駅","鴻巣駅","北鴻巣駅","吹上駅","行田駅","熊谷駅","籠原駅","深谷駅","岡部駅","本庄駅","神保原駅","新町駅","倉賀野駅","高崎駅"];break;
      case "JR吾妻線":item = ["渋川駅","金島駅","祖母島駅","小野上駅","小野上温泉駅","市城駅","中之条駅","群馬原町駅","郷原駅","矢倉駅","岩島駅","川原湯温泉駅","長野原草津口駅","群馬大津駅","羽根尾駅","袋倉駅","万座・鹿沢口駅","大前駅"];break;
      case "JR信越本線":item = ["高崎駅","北高崎駅","群馬八幡駅","安中駅","磯部駅","松井田駅","西松井田駅","横川駅"];break;
      case "東武小泉線":item = ["館林駅","成島駅","本中野駅","篠塚駅","東小泉駅","小泉町駅","西小泉駅","太田駅","竜舞駅"];break;
      case "東武桐生線":item = ["太田駅","三枚橋駅","治良門橋駅","藪塚駅","阿左美駅","新桐生駅","相老駅","赤城駅"];break;
      case "上信電鉄":item = ["高崎駅","南高崎駅","佐野のわたし駅","根小屋駅","高崎商科大学前駅","山名駅","西山名駅","馬庭駅","吉井駅","西吉井駅","上州新屋駅","上州福島駅","東富岡駅","上州富岡駅","西富岡駅","上州七日市駅","上州一ノ宮駅","神農原駅","南蛇井駅","千平駅","下仁田駅"];break;
      case "上毛電気鉄道":item = ["中央前橋駅","城東駅","三俣駅","片貝駅","上泉駅","赤坂駅","心臓血管センター駅","江木駅","大胡駅","樋越駅","北原駅","新屋駅","粕川駅","膳駅","新里駅","新川駅","東新川駅","赤城駅","桐生球場前駅","天王宿駅","富士山下駅","丸山下駅","西桐生駅"];break;

      case '茨城県':item = ["","","","","","","",""];break;
      case "JR常磐線(上野〜取手)":item = ["西桐生駅","日暮里駅","三河島駅","南千住駅","北千住駅","綾瀬駅","亀有駅","金町駅","松戸駅","北松戸駅","馬橋駅","新松戸駅","北小金駅","南柏駅","柏駅","北柏駅","我孫子駅","天王台駅","取手駅"];break;
      case "JR鹿島線":item = ["佐原駅","香取駅","十二橋駅","潮来駅","延方駅","鹿島神宮駅","鹿島サッカースタジアム（臨）駅"];break;
      case "つくばエクスプレス":item = ["秋葉原駅","新御徒町駅","浅草駅","南千住駅","北千住駅","青井駅","六町駅","八潮駅","三郷中央駅","南流山駅","流山セントラルパーク駅","流山おおたかの森駅","柏の葉キャンパス駅","柏たなか駅","守谷駅","みらい平駅","みどりの駅","万博記念公園駅","研究学園駅","つくば駅"];break;
      case "ひたちなか海浜鉄道湊線":item = ["阿字ヶ浦駅","磯崎駅","美乃浜学園駅","平磯駅","殿山駅","那珂湊駅","高田の鉄橋駅","中根駅","金上駅","工機前駅","勝田駅"];break;
      case "関東鉄道竜ヶ崎線":item = ["佐貫駅","入地駅","竜ヶ崎駅"];break;
      case "鹿島臨海鉄道大洗鹿島線":item = ["水戸駅","東水戸駅","常澄駅","大洗駅","涸沼駅","鹿島旭駅","徳宿駅","新鉾田駅","北浦湖畔駅","大洋駅","鹿島灘駅","鹿島大野駅","長者ヶ浜潮騒はまなす公園前駅","荒野台駅","鹿島サッカースタジアム（臨）駅","鹿島神宮駅"];break;
    //
      case '埼玉県':item = ["","","","","","","","","","","","","","","","","",""];break;
      case "JR武蔵野線":item = ["府中本町駅","北府中駅","西国分寺駅","新小平駅","新秋津駅","東所沢駅","新座駅","北朝霞駅","西浦和駅","武蔵浦和駅","南浦和駅","東浦和駅","東川口駅","南越谷駅","越谷レイクタウン駅","吉川駅","吉川美南駅","新三郷駅","三郷駅","南流山駅","新松戸駅","新八柱駅","東松戸駅","市川大野駅","船橋法典駅","西船橋駅"];break;
      case "JR八高線(八王子〜高麗川)":item = ["八王子駅","北八王子駅","小宮駅","拝島駅","東福生駅","箱根ケ崎駅","金子駅","東飯能駅","高麗川駅"];break;
      case "JR川越線":item = ["大宮駅","日進駅","西大宮駅","指扇駅","南古谷駅","川越駅","西川越駅","的場駅","笠幡駅","武蔵高萩駅","高麗川駅"];break;
      case "JR埼京線":item = ["大崎駅","恵比寿駅","渋谷駅","新宿駅","池袋駅","板橋駅","十条駅","赤羽駅","北赤羽駅","浮間舟渡駅","戸田公園駅","戸田駅","北戸田駅","武蔵浦和駅","中浦和駅","南与野駅","与野本町駅","北与野駅","大宮駅"];break;
      case "JR京浜東北線":item = ["大宮駅","さいたま新都心駅","与野駅","北浦和駅","浦和駅","南浦和駅","蕨駅","西川口駅","川口駅","赤羽駅","東十条駅","王子駅","上中里駅","田端駅","西日暮里駅","日暮里駅","鶯谷駅","上野駅","御徒町駅","秋葉原駅","神田駅","東京駅","有楽町駅","新橋駅","浜松町駅","田町駅","高輪ゲートウェイ駅","品川駅","大井町駅","大森駅","蒲田駅","川崎駅","鶴見駅","新子安駅","東神奈川駅","横浜駅"];break;
      case "JR湘南新宿ライン":item = ["大宮駅","浦和駅","赤羽駅","池袋駅","新宿駅","渋谷駅","恵比寿駅","大崎駅","西大井駅","武蔵小杉駅","新川崎駅","横浜駅","保土ケ谷駅","東戸塚駅","戸塚駅","大船駅"];break;
      case "東武東上線":item = ["池袋駅","北池袋駅","下板橋駅","大山駅","中板橋駅","ときわ台駅","上板橋駅","東武練馬駅","下赤塚駅","成増駅","和光市駅","朝霞駅","朝霞台駅","志木駅","柳瀬川駅","みずほ台駅","鶴瀬駅","ふじみ野駅","上福岡駅","新河岸駅","川越駅","川越市駅","霞ヶ関駅","鶴ヶ島駅","若葉駅","坂戸駅","北坂戸駅","高坂駅","東松山駅","森林公園駅","つきのわ駅","武蔵嵐山駅","小川町駅","東武竹沢駅","みなみ寄居駅","男衾駅","鉢形駅","玉淀駅","寄居駅"];break;
      case "東武越生線":item = ["坂戸駅","一本松駅","西大家駅","川角駅","武州長瀬駅","東毛呂駅","武州唐沢駅","越生駅"];break;
      case "東武野田線":item = ["大宮駅","北大宮駅","大宮公園駅","大和田駅","七里駅","岩槻駅","東岩槻駅","豊春駅","八木崎駅","春日部駅","藤の牛島駅","南桜井駅","川間駅","七光台駅","清水公園駅","愛宕駅","野田市駅","梅郷駅","運河駅","江戸川台駅","初石駅","流山おおたかの森駅","豊四季駅","柏駅","新柏駅","増尾駅","逆井駅","高柳駅","六実駅","新鎌ヶ谷駅","鎌ヶ谷駅","馬込沢駅","塚田駅","新船橋駅","船橋駅"];break;
      case "西武池袋線":item = ["池袋駅","椎名町駅","東長崎駅","江古田駅","桜台駅","練馬駅","中村橋駅","富士見台駅","練馬高野台駅","石神井公園駅","大泉学園駅","保谷駅","ひばりヶ丘駅","東久留米駅","清瀬駅","所沢駅","秋津駅","西所沢駅","小手指駅","狭山ヶ丘駅","武蔵藤沢駅","稲荷山公園駅","入間市駅","仏子駅","元加治駅","飯能駅","東飯能駅","高麗駅","武蔵横手駅","東吾野駅","吾野駅"];break;
      case "西武秩父線":item = ["飯能駅","東飯能駅","高麗駅","武蔵横手駅","東吾野駅","吾野駅","西吾野駅","正丸駅","芦ヶ久保駅","横瀬駅","西武秩父駅"];break;
      case "西武狭山線":item = ["西所沢駅","下山口駅","西武球場前駅"];break;
      case "西武新宿線":item = ["西武新宿駅","高田馬場駅","下落合駅","中井駅","新井薬師前駅","沼袋駅","野方駅","都立家政駅","鷺ノ宮駅","下井草駅","井荻駅","上井草駅","上石神井駅","武蔵関駅","東伏見駅","西武柳沢駅","田無駅","花小金井駅","小平駅","久米川駅","東村山駅","所沢駅","航空公園駅","新所沢駅","入曽駅","狭山市駅","新狭山駅","南大塚駅","本川越駅"];break;
      case "西武山口線":item = ["多摩湖駅","西武園ゆうえんち駅","西武球場前駅"];break;
      case "東京メトロ副都心線":item = ["和光市駅","地下鉄成増駅","地下鉄赤塚駅","平和台駅","氷川台駅","小竹向原駅","千川駅","要町駅","池袋駅","雑司が谷駅","西早稲田駅","東新宿駅","新宿三丁目駅","北参道駅","明治神宮前〈原宿〉駅","渋谷駅"];break;
      case "秩父鉄道":item = ["羽生駅","西羽生駅","新郷駅","武州荒木駅","東行田駅","行田市駅","持田駅","ソシオ流通センター駅","熊谷駅","上熊谷駅","石原駅","ひろせ野鳥の森駅","大麻生駅","明戸駅","武川駅","永田駅","ふかや花園駅","小前田駅","桜沢駅","寄居駅","波久礼駅","樋口駅","野上駅","長瀞駅","上長瀞駅","親鼻駅","皆野駅","和銅黒谷駅","大野原駅","秩父駅","御花畑駅","影森駅","浦山口駅","武州中川駅","武州日野駅","白久駅","三峰口駅"];break;
      case "埼玉高速鉄道":item = ["赤羽岩淵駅","川口元郷駅","南鳩ヶ谷駅","鳩ヶ谷駅","新井宿駅","戸塚安行駅","東川口駅","浦和美園駅"];break;
      case "ニューシャトル":item = ["大宮駅","鉄道博物館駅","加茂宮駅","東宮原駅","今羽駅","吉野原駅","原市駅","沼南駅","丸山駅","志久駅","伊奈中央駅","羽貫駅","内宿駅"];break;
    //
      case '東京都':item = [];break;
      case "JR山手線":item = ["大崎駅","五反田駅","目黒駅","恵比寿駅","渋谷駅","原宿駅","代々木駅","新宿駅","新大久保駅","高田馬場駅","目白駅","池袋駅","大塚駅","巣鴨駅","駒込駅","田端駅","西日暮里駅","日暮里駅","鶯谷駅","上野駅","御徒町駅","秋葉原駅","神田駅","東京駅","有楽町駅","新橋駅","浜松町駅","田町駅","高輪ゲートウェイ駅","品川駅"];break;
      case "JR中央線(快速)":item = ["東京駅","神田駅","御茶ノ水駅","四ツ谷駅","新宿駅","中野駅","高円寺駅","阿佐ケ谷駅","荻窪駅","西荻窪駅","吉祥寺駅","三鷹駅","武蔵境駅","東小金井駅","武蔵小金井駅","国分寺駅","西国分寺駅","国立駅","立川駅","日野駅","豊田駅","八王子駅","西八王子駅","高尾駅"];break;
      case "JR中央・総武線":item = ["三鷹駅","吉祥寺駅","西荻窪駅","荻窪駅","阿佐ケ谷駅","高円寺駅","中野駅","東中野駅","大久保駅","新宿駅","代々木駅","千駄ケ谷駅","信濃町駅","四ツ谷駅","市ケ谷駅","飯田橋駅","水道橋駅","御茶ノ水駅","秋葉原駅","浅草橋駅","両国駅","錦糸町駅","亀戸駅","平井駅","新小岩駅","小岩駅","市川駅","本八幡駅","下総中山駅","西船橋駅","船橋駅","東船橋駅","津田沼駅","幕張本郷駅","幕張駅","新検見川駅","稲毛駅","西千葉駅","千葉駅"];break;
      case "JR五日市線":item = ["拝島駅","熊川駅","東秋留駅","秋川駅","武蔵引田駅","武蔵増戸駅","武蔵五日市駅"];break;
      case "JR青梅線":item = ["立川駅","西立川駅","東中神駅","中神駅","昭島駅","拝島駅","牛浜駅","福生駅","羽村駅","小作駅","河辺駅","東青梅駅","青梅駅","宮ノ平駅","日向和田駅","石神前駅","二俣尾駅","軍畑駅","沢井駅","御嶽駅","川井駅","古里駅","鳩ノ巣駅","白丸駅","奥多摩駅"];break;
      case "JR総武本線":item = ["東京駅","新日本橋駅","馬喰町駅","錦糸町駅","新小岩駅","市川駅","船橋駅","津田沼駅","稲毛駅","千葉駅","東千葉駅","都賀駅","四街道駅","物井駅","佐倉駅","南酒々井駅","榎戸駅","八街駅","日向駅","成東駅","松尾駅","横芝駅","飯倉駅","八日市場駅","干潟駅","旭駅","飯岡駅","倉橋駅","猿田駅","松岸駅","銚子駅"];break;
      case "東武亀戸線":item = ["曳舟駅","小村井駅","東あずま駅","亀戸水神駅","亀戸駅"];break;
      case "東武大師線":item = ["西新井駅","大師前駅"];break;
      case "西武有楽町線":item = ["小竹向原駅","新桜台駅","練馬駅"];break;
      case "西武豊島線":item = ["練馬駅","豊島園駅"];break;
      case "西武拝島線":item = ["小平駅","萩山駅","小川駅","東大和市駅","玉川上水駅","武蔵砂川駅","西武立川駅","拝島駅"];break;
      case "西武西武園線":item = ["東村山駅","西武園駅"];break;
      case "西武国分寺線":item = ["国分寺駅","恋ヶ窪駅","鷹の台駅","小川駅","東村山駅"];break;
      case "西武多摩湖線":item = ["国分寺駅","一橋学園駅","青梅街道駅","萩山駅","八坂駅","武蔵大和駅","多摩湖駅"];break;
      case "西武多摩川線":item = ["武蔵境駅","新小金井駅","多磨駅","白糸台駅","競艇場前駅","是政駅"];break;
      case "京成押上線":item = ["押上（スカイツリー前）駅","京成曳舟駅","八広駅","四ツ木駅","京成立石駅","青砥駅","京成高砂駅"];break;
      case "京成金町線":item = ["京成高砂駅","柴又駅","京成金町駅"];break;
      case "京王京王線":item = ["新宿駅","笹塚駅","代田橋駅","明大前駅","下高井戸駅","桜上水駅","上北沢駅","八幡山駅","芦花公園駅","千歳烏山駅","仙川駅","つつじヶ丘駅","柴崎駅","国領駅","布田駅","調布駅","西調布駅","飛田給駅","武蔵野台駅","多磨霊園駅","東府中駅","府中駅","分倍河原駅","中河原駅","聖蹟桜ヶ丘駅","百草園駅","高幡不動駅","南平駅","平山城址公園駅","長沼駅","北野駅","京王八王子駅"];break;
      case "京王相模原線":item = ["調布駅","京王多摩川駅","京王稲田堤駅","京王よみうりランド駅","稲城駅","若葉台駅","京王永山駅","京王多摩センター駅","京王堀之内駅","南大沢駅","多摩境駅","橋本駅"];break;
      case "京王高尾線":item = ["北野駅","京王片倉駅","山田駅","めじろ台駅","狭間駅","高尾駅","高尾山口駅"];break;
      case "京王競馬場線":item = ["東府中駅","府中競馬正門前駅"];break;
      case "京王動物園線":item = ["高幡不動駅","多摩動物公園駅"];break;
      case "京王井の頭線":item = ["渋谷駅","神泉駅","駒場東大前駅","池ノ上駅","下北沢駅","新代田駅","東松原駅","明大前駅","永福町駅","西永福駅","浜田山駅","高井戸駅","富士見ヶ丘駅","久我山駅","三鷹台駅","井の頭公園駅","吉祥寺駅"];break;
      case "東急大井町線":item = ["大井町駅","下神明駅","戸越公園駅","中延駅","荏原町駅","旗の台駅","北千束駅","大岡山駅","緑が丘駅","自由が丘駅","九品仏駅","尾山台駅","等々力駅","上野毛駅","二子玉川駅","二子新地駅","高津駅","溝の口駅"];break;
      case "東急池上線":item = ["五反田駅","大崎広小路駅","戸越銀座駅","荏原中延駅","旗の台駅","長原駅","洗足池駅","石川台駅","雪が谷大塚駅","御嶽山駅","久が原駅","千鳥町駅","池上駅","蓮沼駅","蒲田駅"];break;
      case "東急多摩川線":item = ["多摩川駅","沼部駅","鵜の木駅","下丸子駅","武蔵新田駅","矢口渡駅","蒲田駅"];break;
      case "東急世田谷線":item = ["三軒茶屋駅","西太子堂駅","若林駅","松陰神社前駅","世田谷駅","上町駅","宮の坂駅","山下駅","松原駅","下高井戸駅"];break;
      case "京急空港線":item = ["京急蒲田駅","糀谷駅","大鳥居駅","穴守稲荷駅","天空橋駅","羽田空港第3ターミナル駅","羽田空港第1・第2ターミナル駅"];break;
      case "東京メトロ銀座線":item = ["浅草駅","田原町駅","稲荷町駅","上野駅","上野広小路駅","末広町駅","神田駅","三越前駅","日本橋駅","京橋駅","銀座駅","新橋駅","虎ノ門駅","溜池山王駅","赤坂見附駅","青山一丁目駅","外苑前駅","表参道駅","渋谷駅"];break;
      case "東京メトロ丸ノ内線":item = ["池袋駅","新大塚駅","茗荷谷駅","後楽園駅","本郷三丁目駅","御茶ノ水駅","淡路町駅","大手町駅","東京駅","銀座駅","霞ケ関駅","国会議事堂前駅","赤坂見附駅","四ツ谷駅","四谷三丁目駅","新宿御苑前駅","新宿三丁目駅","新宿駅","西新宿駅","中野坂上駅","新中野駅","東高円寺駅","新高円寺駅","南阿佐ケ谷駅","荻窪駅","中野新橋駅","中野富士見町駅","方南町駅"];break;
      case "東京メトロ日比谷線":item = ["北千住駅","南千住駅","三ノ輪駅","入谷駅","上野駅","仲御徒町駅","秋葉原駅","小伝馬町駅","人形町駅","茅場町駅","八丁堀駅","築地駅","東銀座駅","銀座駅","日比谷駅","霞ケ関駅","虎ノ門ヒルズ駅","神谷町駅","六本木駅","広尾駅","恵比寿駅","中目黒駅"];break;
      case "東京メトロ千代田線":item = ["北綾瀬駅","綾瀬駅","北千住駅","町屋駅","西日暮里駅","千駄木駅","根津駅","湯島駅","新御茶ノ水駅","大手町駅","二重橋前駅","日比谷駅","霞ケ関駅","国会議事堂前駅","赤坂駅","乃木坂駅","表参道駅","明治神宮前〈原宿〉駅","代々木公園駅","代々木上原駅"];break;
      case "東京メトロ有楽町線":item = ["和光市駅","地下鉄成増駅","地下鉄赤塚駅","平和台駅","氷川台駅","小竹向原駅","千川駅","要町駅","池袋駅","東池袋駅","護国寺駅","江戸川橋駅","飯田橋駅","市ケ谷駅","麹町駅","永田町駅","桜田門駅","有楽町駅","銀座一丁目駅","新富町駅","月島駅","豊洲駅","辰巳駅","新木場駅"];break;
      case "東京メトロ半蔵門線":item = ["渋谷駅","表参道駅","青山一丁目駅","永田町駅","半蔵門駅","九段下駅","神保町駅","大手町駅","三越前駅","水天宮前駅","清澄白河駅","住吉駅","錦糸町駅","押上〈スカイツリー前〉駅"];break;
      case "東京メトロ南北線":item = ["赤羽岩淵駅","志茂駅","王子神谷駅","王子駅","西ケ原駅","駒込駅","本駒込駅","東大前駅","後楽園駅","飯田橋駅","市ケ谷駅","四ツ谷駅","永田町駅","溜池山王駅","六本木一丁目駅","麻布十番駅","白金高輪駅","白金台駅","目黒駅"];break;
      case "都営大江戸線":item = ["都庁前駅","新宿西口駅","東新宿駅","若松河田駅","牛込柳町駅","牛込神楽坂駅","飯田橋駅","春日駅","本郷三丁目駅","上野御徒町駅","新御徒町駅","蔵前駅","両国駅","森下駅","清澄白河駅","門前仲町駅","月島駅","勝どき駅","築地市場駅","汐留駅","大門駅","赤羽橋駅","麻布十番駅","六本木駅","青山一丁目駅","国立競技場駅","代々木駅","新宿駅","西新宿五丁目駅","中野坂上駅","東中野駅","中井駅","落合南長崎駅","新江古田駅","練馬駅","豊島園駅","練馬春日町駅","光が丘駅"];break;
      case "都営浅草線":item = ["西馬込駅","馬込駅","中延駅","戸越駅","五反田駅","高輪台駅","泉岳寺駅","三田駅","大門駅","新橋駅","東銀座駅","宝町駅","日本橋駅","人形町駅","東日本橋駅","浅草橋駅","蔵前駅","浅草駅","本所吾妻橋駅","押上（スカイツリー前）駅"];break;
      case "都営三田線":item = ["目黒駅","白金台駅","白金高輪駅","三田駅","芝公園駅","御成門駅","内幸町駅","日比谷駅","大手町駅","神保町駅","水道橋駅","春日駅","白山駅","千石駅","巣鴨駅","西巣鴨駅","新板橋駅","板橋区役所前駅","板橋本町駅","本蓮沼駅","志村坂上駅","志村三丁目駅","蓮根駅","西台駅","高島平駅","新高島平駅","西高島平駅"];break;
      case "都営都電荒川線":item = ["三ノ輪橋駅","荒川一中前駅","荒川区役所前駅","荒川二丁目駅","荒川七丁目駅","町屋駅前駅","町屋二丁目駅","東尾久三丁目駅","熊野前駅","宮ノ前駅","小台駅","荒川遊園地前駅","荒川車庫前駅","梶原駅","栄町駅","王子駅前駅","飛鳥山駅","滝野川一丁目駅","西ヶ原四丁目駅","新庚申塚駅","庚申塚駅","巣鴨新田駅","大塚駅前駅","向原駅","東池袋四丁目駅","都電雑司ヶ谷駅","鬼子母神前駅","学習院下駅","面影橋駅","早稲田駅"];break;
      case "ゆりかもめ":item = ["新橋駅","汐留駅","竹芝駅","日の出駅","芝浦ふ頭駅","お台場海浜公園駅","台場駅","東京国際クルーズターミナル駅","テレコムセンター駅","青海駅","東京ビッグサイト駅","有明駅","有明テニスの森駅","市場前駅","新豊洲駅","豊洲駅"];break;
      case "多摩モノレール":item = ["多摩センター駅","松が谷駅","大塚・帝京大学駅","中央大学・明星大学駅","多摩動物公園駅","程久保駅","高幡不動駅","万願寺駅","甲州街道駅","柴崎体育館駅","立川南駅","立川北駅","高松駅","立飛駅","泉体育館駅","砂川七番駅","玉川上水駅","桜街道駅","上北台駅"];break;
      case "東京モノレール":item = ["浜松町駅","天王洲アイル駅","大井競馬場前駅","流通センター駅","昭和島駅","整備場駅","天空橋駅","羽田空港第3ターミナル駅","新整備場駅","羽田空港第1ターミナル駅","羽田空港第2ターミナル駅"];break;
      case "東京臨海高速鉄道":item = ["新木場駅","東雲駅","国際展示場駅","東京テレポート駅","天王洲アイル駅","品川シーサイド駅","大井町駅","大崎駅"];break;
      case "北総鉄道":item = ["京成高砂駅","新柴又駅","矢切駅","北国分駅","秋山駅","東松戸駅","松飛台駅","大町駅","新鎌ヶ谷駅","西白井駅","白井駅","小室駅","千葉ニュータウン中央駅","印西牧の原駅","印旛日本医大駅"];break;
//
      case '千葉県':item = ["",""];break;
      case "JR外房線":item = ["千葉駅","本千葉駅","蘇我駅","鎌取駅","誉田駅","土気駅","大網駅","永田駅","本納駅","新茂原駅","茂原駅","八積駅","上総一ノ宮駅","東浪見駅","太東駅","長者町駅","三門駅","大原駅","浪花駅","御宿駅","勝浦駅","鵜原駅","上総興津駅","行川アイランド駅","安房小湊駅","安房天津駅","安房鴨川駅"];break;
      case "JR内房線":item = ["千葉駅","本千葉駅","蘇我駅","浜野駅","八幡宿駅","五井駅","姉ケ崎駅","長浦駅","袖ケ浦駅","巌根駅","木更津駅","君津駅","青堀駅","大貫駅","佐貫町駅","上総湊駅","竹岡駅","浜金谷駅","保田駅","安房勝山駅","岩井駅","富浦駅","那古船形駅","館山駅","九重駅","千倉駅","千歳駅","南三原駅","和田浦駅","江見駅","太海駅","安房鴨川駅"];break;
      case "JR京葉線":item = ["東京駅","八丁堀駅","越中島駅","潮見駅","新木場駅","葛西臨海公園駅","舞浜駅","新浦安駅","市川塩浜駅","西船橋駅","二俣新町駅","南船橋駅","新習志野駅","海浜幕張駅","検見川浜駅","稲毛海岸駅","千葉みなと駅","蘇我駅"];break;
      case "JR成田線":item = ["佐倉駅","酒々井駅","成田駅","空港第２ビル（第２旅客ターミナル）駅","成田空港（第１旅客ターミナル）駅","久住駅","滑河駅","下総神崎駅","大戸駅","佐原駅","香取駅","水郷駅","小見川駅","笹川駅","下総橘駅","下総豊里駅","椎柴駅","松岸駅","銚子駅","我孫子駅","東我孫子駅","湖北駅","新木駅","布佐駅","木下駅","小林駅","安食駅","下総松崎駅"];break;
      case "JR東金線":item = ["大網駅","福俵駅","東金駅","求名駅","成東駅"];break;
      case "JR久留里線":item = ["木更津駅","祇園駅","上総清川駅","東清川駅","横田駅","東横田駅","馬来田駅","下郡駅","小櫃駅","俵田駅","久留里駅","平山駅","上総松丘駅","上総亀山駅"];break;
      case "京成本線":item = ["京成上野駅","日暮里駅","新三河島駅","町屋駅","千住大橋駅","京成関屋駅","堀切菖蒲園駅","お花茶屋駅","青砥駅","京成高砂駅","京成小岩駅","江戸川駅","国府台駅","市川真間駅","菅野駅","京成八幡駅","鬼越駅","京成中山駅","東中山駅","京成西船駅","海神駅","京成船橋駅","大神宮下駅","船橋競馬場駅","谷津駅","京成津田沼駅","京成大久保駅","実籾駅","八千代台駅","京成大和田駅","勝田台駅","志津駅","ユーカリが丘駅","京成臼井駅","京成佐倉駅","大佐倉駅","京成酒々井駅","宗吾参道駅","公津の杜駅","京成成田駅","東成田駅","空港第２ビル（第２旅客ターミナル）駅","成田空港（第１旅客ターミナル）駅"];break;
      case "京成千葉線":item = ["京成津田沼駅","京成幕張本郷駅","京成幕張駅","検見川駅","京成稲毛駅","みどり台駅","西登戸駅","新千葉駅","京成千葉駅","千葉中央駅"];break;
      case "京成千原線":item = ["千葉中央駅","千葉寺駅","大森台駅","学園前駅","おゆみ野駅","ちはら台駅"];break;
      case "京成成田空港線(成田スカイアクセス)":item = ["京成上野駅","日暮里駅","青砥駅","京成高砂駅","東松戸駅","新鎌ヶ谷駅","千葉ニュータウン中央駅","印旛日本医大駅","成田湯川駅","空港第２ビル（第２旅客ターミナル）駅","成田空港（第１旅客ターミナル）駅"];break;
      case "東京メトロ東西線":item = ["中野駅","落合駅","高田馬場駅","早稲田駅","神楽坂駅","飯田橋駅","九段下駅","竹橋駅","大手町駅","日本橋駅","茅場町駅","門前仲町駅","木場駅","東陽町駅","南砂町駅","西葛西駅","葛西駅","浦安駅","南行徳駅","行徳駅","妙典駅","原木中山駅","西船橋駅"];break;
      case "都営新宿線":item = ["新宿駅","新宿三丁目駅","曙橋駅","市ヶ谷駅","九段下駅","神保町駅","小川町駅","岩本町駅","馬喰横山駅","浜町駅","森下駅","菊川駅","住吉駅","西大島駅","大島駅","東大島駅","船堀駅","一之江駅","瑞江駅","篠崎駅","本八幡駅"];break;
      case "いすみ鉄道":item = ["大原駅","西大原駅","上総東駅","新田野駅","国吉駅","上総中川駅","城見ヶ丘駅","大多喜駅","小谷松駅","東総元駅","久我原駅","総元駅","西畑駅","上総中野駅"];break;
      case "ユーカリが丘線":item = ["ユーカリが丘駅","地区センター駅","公園駅","女子大駅","中学校駅","井野駅"];break;
      case "芝山鉄道":item = ["東成田駅","芝山千代田駅"];break;
      case "小湊鉄道":item = ["五井駅","上総村上駅","海士有木駅","上総三又駅","上総山田駅","光風台駅","馬立駅","上総牛久駅","上総川間駅","上総鶴舞駅","上総久保駅","高滝駅","里見駅","飯給駅","月崎駅","上総大久保駅","養老渓谷駅","上総中野駅"];break;
      case "新京成電鉄線":item = ["京成津田沼駅","新津田沼駅","前原駅","薬園台駅","習志野駅","北習志野駅","高根木戸駅","高根公団駅","滝不動駅","三咲駅","二和向台駅","鎌ヶ谷大仏駅","初富駅","新鎌ヶ谷駅","北初富駅","くぬぎ山駅","元山駅","五香駅","常盤平駅","八柱駅","みのり台駅","松戸新田駅","上本郷駅","松戸駅"];break;
      case "千葉都市モノレール１号線":item = ["千葉みなと駅","市役所前駅","千葉駅","栄町駅","葭川公園駅","県庁前駅"];break;
      case "千葉都市モノレール２号線":item = ["千葉駅","千葉公園駅","作草部駅","天台駅","穴川駅","スポーツセンター駅","動物公園駅","みつわ台駅","都賀駅","桜木駅","小倉台駅","千城台北駅","千城台駅"];break;
      case "流鉄流山線":item = ["馬橋駅","幸谷駅","小金城趾駅","鰭ヶ崎駅","平和台駅","流山駅"];break;
      case "銚子電鉄線":item = ["銚子駅","仲ノ町駅","観音駅","本銚子駅","笠上黒生駅","西海鹿島駅","海鹿島駅","君ヶ浜駅","犬吠駅","外川駅"];break;
      case "東葉高速鉄道":item = ["西船橋駅","東海神駅","飯山満駅","北習志野駅","船橋日大前駅","八千代緑が丘駅","八千代中央駅","村上駅","東葉勝田台駅"];break;
    //
      case '神奈川県':item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR東海道本線(東京〜熱海)":item = ["東京駅","新橋駅","品川駅","川崎駅","横浜駅","戸塚駅","大船駅","藤沢駅","辻堂駅","茅ケ崎駅","平塚駅","大磯駅","二宮駅","国府津駅","鴨宮駅","小田原駅","早川駅","根府川駅","真鶴駅","湯河原駅","熱海駅"];break;
      case "JR南武線":item = ["川崎駅","尻手駅","矢向駅","鹿島田駅","平間駅","向河原駅","武蔵小杉駅","武蔵中原駅","武蔵新城駅","武蔵溝ノ口駅","津田山駅","久地駅","宿河原駅","登戸駅","中野島駅","稲田堤駅","矢野口駅","稲城長沼駅","南多摩駅","府中本町駅","分倍河原駅","西府駅","谷保駅","矢川駅","西国立駅","立川駅","八丁畷駅","川崎新町駅","小田栄駅","浜川崎駅"];break;
      case "JR鶴見線":item = ["鶴見駅","国道駅","鶴見小野駅","弁天橋駅","浅野駅","新芝浦駅","海芝浦駅","安善駅","大川駅","武蔵白石駅","浜川崎駅","昭和駅","扇町駅"];break;
      case "JR横須賀線":item = ["東京駅","新橋駅","品川駅","西大井駅","武蔵小杉駅","新川崎駅","横浜駅","保土ケ谷駅","東戸塚駅","戸塚駅","大船駅","北鎌倉駅","鎌倉駅","逗子駅","東逗子駅","田浦駅","横須賀駅","衣笠駅","久里浜駅"];break;
      case "JR根岸線":item = ["横浜駅","桜木町駅","関内駅","石川町駅","山手駅","根岸駅","磯子駅","新杉田駅","洋光台駅","港南台駅","本郷台駅","大船駅"];break;
      case "JR横浜線":item = ["東神奈川駅","大口駅","菊名駅","新横浜駅","小机駅","鴨居駅","中山駅","十日市場駅","長津田駅","成瀬駅","町田駅","古淵駅","淵野辺駅","矢部駅","相模原駅","橋本駅","相原駅","八王子みなみ野駅","片倉駅","八王子駅"];break;
      case "JR相模線":item = ["茅ケ崎駅","北茅ケ崎駅","香川駅","寒川駅","宮山駅","倉見駅","門沢橋駅","社家駅","厚木駅","海老名駅","入谷駅","相武台下駅","下溝駅","原当麻駅","番田駅","上溝駅","南橋本駅","橋本駅"];break;
      case "JR成田エクスプレス":item = ["大船駅","戸塚駅","横浜駅","武蔵小杉駅","大宮駅","池袋駅","新宿駅","高尾駅","八王子駅","立川駅","国分寺駅","三鷹駅","吉祥寺駅","渋谷駅","品川駅","東京駅","千葉駅","四街道駅","佐倉駅","成田駅","空港第２ビル（第２旅客ターミナル）駅","成田空港（第１旅客ターミナル）駅"];break;
      case "小田急小田原線":item = ["新宿駅","南新宿駅","参宮橋駅","代々木八幡駅","代々木上原駅","東北沢駅","下北沢駅","世田谷代田駅","梅ヶ丘駅","豪徳寺駅","経堂駅","千歳船橋駅","祖師ヶ谷大蔵駅","成城学園前駅","喜多見駅","狛江駅","和泉多摩川駅","登戸駅","向ヶ丘遊園駅","生田駅","読売ランド前駅","百合ヶ丘駅","新百合ヶ丘駅","柿生駅","鶴川駅","玉川学園前駅","町田駅","相模大野駅","小田急相模原駅","相武台前駅","座間駅","海老名駅","厚木駅","本厚木駅","愛甲石田駅","伊勢原駅","鶴巻温泉駅","東海大学前駅","秦野駅","渋沢駅","新松田駅","開成駅","栢山駅","富水駅","螢田駅","足柄駅","小田原駅"];break;
      case "小田急江ノ島線":item = ["相模大野駅","東林間駅","中央林間駅","南林間駅","鶴間駅","大和駅","桜ヶ丘駅","高座渋谷駅","長後駅","湘南台駅","六会日大前駅","善行駅","藤沢本町駅","藤沢駅","本鵠沼駅","鵠沼海岸駅","片瀬江ノ島駅"];break;
      case "小田急多摩線":item = ["新百合ヶ丘駅","五月台駅","栗平駅","黒川駅","はるひ野駅","小田急永山駅","小田急多摩センター駅","唐木田駅"];break;
      case "東急東横線":item = ["渋谷駅","代官山駅","中目黒駅","祐天寺駅","学芸大学駅","都立大学駅","自由が丘駅","田園調布駅","多摩川駅","新丸子駅","武蔵小杉駅","元住吉駅","日吉駅","綱島駅","大倉山駅","菊名駅","妙蓮寺駅","白楽駅","東白楽駅","反町駅","横浜駅"];break;
      case "東急目黒線":item = ["目黒駅","不動前駅","武蔵小山駅","西小山駅","洗足駅","大岡山駅","奥沢駅","田園調布駅","多摩川駅","新丸子駅","武蔵小杉駅","元住吉駅","日吉駅"];break;
      case "東急田園都市線":item = ["渋谷駅","池尻大橋駅","三軒茶屋駅","駒沢大学駅","桜新町駅","用賀駅","二子玉川駅","二子新地駅","高津駅","溝の口駅","梶が谷駅","宮崎台駅","宮前平駅","鷺沼駅","たまプラーザ駅","あざみ野駅","江田駅","市が尾駅","藤が丘駅","青葉台駅","田奈駅","長津田駅","つくし野駅","すずかけ台駅","南町田グランベリーパーク駅","つきみ野駅","中央林間駅"];break;
      case "東急こどもの国線":item = ["長津田駅","恩田駅","こどもの国駅"];break;
      case "京急本線":item = ["泉岳寺駅","品川駅","北品川駅","新馬場駅","青物横丁駅","鮫洲駅","立会川駅","大森海岸駅","平和島駅","大森町駅","梅屋敷駅","京急蒲田駅","雑色駅","六郷土手駅","京急川崎駅","八丁畷駅","鶴見市場駅","京急鶴見駅","花月総持寺駅","生麦駅","京急新子安駅","子安駅","神奈川新町駅","京急東神奈川駅","神奈川駅","横浜駅","戸部駅","日ノ出町駅","黄金町駅","南太田駅","井土ヶ谷駅","弘明寺駅","上大岡駅","屏風浦駅","杉田駅","京急富岡駅","能見台駅","金沢文庫駅","金沢八景駅","追浜駅","京急田浦駅","安針塚駅","逸見駅","汐入駅","横須賀中央駅","県立大学駅","堀ノ内駅","京急大津駅","馬堀海岸駅","浦賀駅"];break;
      case "京急大師線":item = ["京急川崎駅","港町駅","鈴木町駅","川崎大師駅","東門前駅","大師橋駅","小島新田駅"];break;
      case "京急逗子線":item = ["金沢八景駅","六浦駅","神武寺駅","逗子・葉山駅"];break;
      case "京急久里浜線":item = ["堀ノ内駅","新大津駅","北久里浜駅","京急久里浜駅","ＹＲＰ野比駅","京急長沢駅","津久井浜駅","三浦海岸駅","三崎口駅"];break;
      case "相鉄本線":item = ["横浜駅","平沼橋駅","西横浜駅","天王町駅","星川駅","和田町駅","上星川駅","西谷駅","鶴ヶ峰駅","二俣川駅","希望ヶ丘駅","三ツ境駅","瀬谷駅","大和駅","相模大塚駅","さがみ野駅","かしわ台駅","海老名駅"];break;
      case "相鉄いずみ野線":item = ["二俣川駅","南万騎が原駅","緑園都市駅","弥生台駅","いずみ野駅","いずみ中央駅","ゆめが丘駅","湘南台駅"];break;
      case "みなとみらい線":item = ["横浜駅","新高島駅","みなとみらい駅","馬車道駅","日本大通り駅","元町・中華街駅"];break;
      case "伊豆箱根鉄道大雄山線":item = ["小田原駅","緑町駅","井細田駅","五百羅漢駅","穴部駅","飯田岡駅","相模沼田駅","岩原駅","塚原駅","和田河原駅","富士フイルム前駅","大雄山駅"];break;
      case "横浜市営地下鉄ブルーライン・グリーンライン":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "横浜新都市交通金沢シーサイドライン":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "江ノ島電鉄線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "湘南モノレール":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "箱根登山鉄道":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
//
      case '岐阜県': item = ["","","","","","","","","","","","",""];break;
      case "JR高山本線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR東海道本線(岐阜〜美濃赤坂・米原)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR太多線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄名古屋本線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄犬山線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄各務原線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄広見線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄竹鼻線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄羽島線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "明知鉄道":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "長良川鉄道越美南線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "樽見鉄道":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "養老鉄道養老線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
    //
      case '静岡県':item = ["","",")","","","","","","","","",""];break;
      case "JR伊東線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR東海道本線(浜松〜岐阜)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR東海道本線(熱海〜浜松":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR御殿場線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "伊豆急行":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "伊豆箱根鉄道駿豆線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "岳南鉄道":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "静岡鉄道静岡清水線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "天竜浜名湖鉄道":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "遠州鉄道":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "大井川鐵道大井川本線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "大井川鐵道井川線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
//
      case '愛知県':item = ["","","","","","","","","","","","",];break;
      case "JR飯田線(豊橋〜天竜峡)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR関西本線(名古屋〜亀山)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "JR武豊線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄豊川線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄西尾線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄豊田線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄三河線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄蒲郡線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄空港線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄常滑線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄河和線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄瀬戸線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄築港線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄知多新線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄津島線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄尾西線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄小牧線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名鉄広見線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "西名古屋港線(あおなみ線)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "東海交通事業城北線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "愛知環状鉄道":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "東部丘陵線(リニモ)":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名古屋市営地下鉄東山線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名古屋市営地下鉄名城線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名古屋市営地下鉄名港線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名古屋市営地下鉄上飯田線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名古屋市営地下鉄桜通線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "名古屋市営地下鉄鶴舞線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "豊橋鉄道渥美線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "豊橋鉄道東田本線":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "ゆとりーとライン":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
     //
      case '三重県':item = ["JR関西本線(亀山〜加茂)","JR紀勢本線","JR草津線","JR参宮線","JR名松線","近鉄大阪線","近鉄湯の山線","近鉄山田線","近鉄鳥羽線","近鉄内部線","近鉄八王子線","近鉄名古屋線","近鉄鈴鹿線","近鉄志摩線","三岐鉄道三岐線","三岐鉄道北勢線","伊勢鉄道","伊賀鉄道伊賀線","養老鉄道養老線"];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;
      case "":item = ["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];break;

      case '滋賀県':item = ["JR北陸本線(米原〜富山)","JR草津線","京阪京津線","京阪石山坂本線","近江鉄道本線","近江鉄道多賀線","近江鉄道八日市線","信楽高原鐵道"];break;
      case '京都府':item = ["JR東海道本線(琵琶湖線)(米原〜京都)","JR湖西線","JR山陰本線(嵯峨野線)(京都〜園部)","JR片町線(学研都市線)","JR舞鶴線","JR福知山線(篠山口〜福知山)","近鉄京都線","京阪本線","京阪宇治線","京阪鴨東線","京阪男山ケーブル","京阪京津線","阪急京都本線","阪急嵐山線","嵯峨野観光鉄道","叡山電鉄叡山本線","叡山電鉄鞍馬線","北近畿タンゴ鉄道宮福線","北近畿タンゴ鉄道宮津線","京都市営地下鉄烏丸線","京都市営地下鉄東西線","京福電鉄嵐山本線","京福電鉄北野線"];break;
      case '大阪府':item = ["JR東海道本線(京都線)(京都〜大阪)","JR片町線(学研都市線)","JR大阪環状線","JR桜島線(ゆめ咲線)","JR東西線","JR阪和線(鳳〜東羽衣)","JR関西空港線","JRおおさか東線","近鉄難波線","近鉄南大阪線","近鉄道明寺線","近鉄信貴線","近鉄長野線","近鉄西信貴ケーブル","南海空港線","南海高師浜線","南海多奈川線","南海高野線(りんかんサンライン)","南海汐見橋線","京阪本線","京阪交野線","京阪中之島線","阪急神戸本線","阪急宝塚本線","阪急京都本線","阪急箕面線","阪急千里線","北大阪急行電鉄","泉北高速鉄道線","水間鉄道","大阪市営地下鉄御堂筋線","大阪市営地下鉄谷町線","大阪市営地下鉄四つ橋線","大阪市営地下鉄中央線","大阪市営地下鉄千日前線","大阪市営地下鉄堺筋線","大阪市営地下鉄長堀鶴見緑地線","大阪市営地下鉄南港ポートタウン線","大阪市営地下鉄今里筋線","大阪モノレール線","大阪モノレール彩都線","阪堺電軌上町線","阪堺電軌阪堺線","能勢電鉄妙見線"];break;
      case '兵庫県':item = ["JR東海道本線(神戸線)(大阪〜神戸)","JR山陽本線(神戸線)(神戸〜姫路)","JR山陽本線(姫路〜岡山)","JR山陽本線(兵庫〜和田岬)","JR山陰本線(園部〜豊岡)","JR山陰本線(豊岡〜米子)","JR東西線","JR赤穂線","JR加古川線","JR姫新線(姫路〜佐用)","JR播但線","JR姫新線(佐用〜新見)","阪急神戸本線","阪急宝塚本線","阪急今津線","阪急甲陽線","阪急伊丹線","阪神本線","阪神なんば線","阪神武庫川線","北近畿タンゴ鉄道宮津線","神戸高速東西線","神戸高速南北線","神鉄有馬線","神鉄三田線","神鉄公園都市線","神鉄粟生線","北神急行電鉄","山陽電鉄本線","山陽電鉄網干線","能勢電鉄妙見線","北条鉄道","神戸市営地下鉄西神線","神戸市営地下鉄山手線","神戸市営地下鉄海岸線(夢かもめ)","神戸新交通ポートアイランド線","神戸新交通六甲アイランド線"];break;
      case '奈良県':item = ["JR関西本線(大和路線)(加茂〜ＪＲ難波)","JR奈良線","JR桜井線","近鉄橿原線","近鉄南大阪線","近鉄大阪線","近鉄吉野線","近鉄天理線","近鉄生駒線","近鉄田原本線","近鉄御所線","近鉄奈良線","近鉄けいはんな線","近鉄生駒ケーブル"];break;
      case '和歌山県':item = ["JR紀勢本線","JR阪和線(天王寺〜和歌山)","JR和歌山線","JR紀勢本線(きのくに線)(新宮〜和歌山)","JR紀勢本線(和歌山〜和歌山市)","南海本線","南海和歌山港線","南海加太線","南海高野線(りんかんサンライン)","南海高野山ケーブル","紀州鉄道","わかやま電鉄貴志川線"];break;
      case '鳥取県':item = ["JR山陰本線(豊岡〜米子)","JR山陰本線(米子〜益田)","JR伯備線","JR因美線","JR境線","智頭急行","若桜鉄道"];break;
      case '島根県':item = ["JR山陰本線(益田〜下関)","JR山口線","一畑電車北松江線","一畑電車大社線"];break;
      case '岡山県':item = ["JR山陽本線(岡山〜三原)","JR赤穂線","JR姫新線(佐用〜新見)","JR本四備讃線(瀬戸大橋線)","JR吉備線","JR津山線","智頭急行","水島臨海鉄道","井原鉄道","岡山電軌東山本線","岡山電軌清輝橋線"];break;
      case '広島県':item = ["JR山陽本線(三原〜岩国)","JR木次線","JR三江線","JR芸備線","JR呉線","JR可部線","JR福塩線","井原鉄道","スカイレールサービス","アストラムライン","広電１系統(宇品線)","広電２系統(宮島線)","広電３系統(己斐線)","広電５系統(比治山線)","広電６系統(江波線)","広電７系統(都心線)","広電８系統(横川線)","広電９系統(白島線)",];break;
      case '山口県':item = ["JR山陽本線(岩国〜門司)","JR宇部線","JR美祢線","JR小野田線","JR岩徳線","錦川鉄道錦川清流線"];break;
      case '徳島県':item = ["JR土讃線","JR高徳線","JR徳島線(よしの川ブルーライン)","JR牟岐線","JR鳴門線","阿佐海岸鉄道阿佐東線"];break;
      case '香川県':item = ["JR本四備讃線(瀬戸大橋線)","JR土讃線","JR高徳線","JR予讃線","琴電琴平線","琴電長尾線","琴電志度線"];break;
      case '愛媛県':item = ["JR予讃・内子線","伊予鉄道郡中線","伊予鉄道高浜線","伊予鉄道横河原線","伊予鉄道１系統(環状線)","伊予鉄道２系統(環状線)","伊予鉄道３系統(市駅線)","伊予鉄道５系統(松山駅前線)","伊予鉄道６系統(本町線)"];break;
      case '高知県':item = ["JR土讃線","JR予土線(しまんとグリーンライン)","阿佐海岸鉄道阿佐東線","土佐くろしお鉄道中村線","土佐くろしお鉄道中村線","土佐くろしお鉄道ごめん・なはり線","土佐電鉄ごめん線","土佐電鉄伊野線","土佐電鉄桟橋線"];break;
      case '福岡県':item = ["JR博多南線","JR鹿児島本線(下関・門司港〜博多)","JR篠栗線(福北ゆたか線)","JR筑豊本線(若松線)(若松〜折尾)","JR筑豊本線(福北ゆたか線)(折尾〜桂川)","JR筑豊本線(原田線)(桂川〜原田)","JR後藤寺線","JR香椎線(海の中道線)(西戸崎〜香椎)","JR香椎線(香椎〜宇美)","西鉄天神大牟田線","西鉄太宰府線","西鉄甘木線","西鉄貝塚線","甘木鉄道","平成筑豊鉄道伊田線","平成筑豊鉄道糸田線","平成筑豊鉄道田川線","福岡市営地下鉄空港線","福岡市営地下鉄箱崎線","福岡市営地下鉄七隈線","北九州高速鉄道","筑豊電気鉄道"];break;
      case '佐賀県':item = ["JR鹿児島本線(博多〜八代)""JR筑肥線(姪浜〜西唐津)","JR佐世保線","JR筑肥線(西唐津〜伊万里)","JR唐津線","甘木鉄道","松浦鉄道西九州線(有田〜伊万里)","松浦鉄道西九州線(伊万里〜佐世保)"];break;
      case '長崎県':item = ["JR長崎本線(鳥栖〜長崎)","JR佐世保線","JR大村線","松浦鉄道西九州線(伊万里〜佐世保)","島原鉄道","長崎電軌１系統","長崎電軌３系統","長崎電軌４系統","長崎電軌５系統"];break;
      case '熊本県':item = ["JR豊肥本線(阿蘇高原線)","JR三角線","熊本電鉄本線","熊本電鉄上熊本線","南阿蘇鉄道高森線","くま川鉄道湯前線","肥薩おれんじ鉄道","熊本市電Ａ系統","熊本市電Ｂ系統"];break;
      case '大分県':item = ["JR日豊本線(門司港〜佐伯)","JR久大本線(ゆふ高原線)","JR日田彦山線","JR豊肥本線(阿蘇高原線)"];break;
      case '宮崎県':item = ["JR日豊本線(佐伯〜鹿児島中央)","JR肥薩線(えびの高原線)(八代〜吉松)","JR宮崎空港線","JR日南線","JR吉都線(えびの高原線)"];break;
      case '鹿児島県':item = ["JR鹿児島本線(川内〜鹿児島)","JR肥薩線(吉松〜隼人)","JR指宿枕崎線","肥薩おれんじ鉄道","鹿児島市電１系統","鹿児島市電２系統",];break;
      case '沖縄県':item = ["ゆいレール"];break;
      default:
        break;
    } setState(() {});
  }
}

class V1V3B extends StatefulWidget {
  V1V3B(this.Select);
  String Select;
  @override
  State<V1V3B> createState() => _V1V3BState();
}
class _V1V3BState extends State<V1V3B> {
  @override
  @override
  bool aka = true;
  var co = 0;
  var colorbid = 0.01;
  var color = Colors.red;
  var item = [];
  var uid = "";
  void initState() {
    super.initState();
    _loadData();
  }
  Widget build(BuildContext context) {
    return new Scaffold(
        body:  Container(
            child: Column(children: <Widget>[
              Expanded(
                child: ListView.builder(
                  itemCount: item.length,
                  itemBuilder: (context, index) {
                    return GestureDetector(
                        onTap: () {   Navigator.of(context).push(
                            MaterialPageRoute(
                                builder: (context) => V1V4(item[index])));},
                        child:Card(
                          shadowColor: Colors.grey[100],
                          elevation: 3,
                          clipBehavior: Clip.antiAlias,
                          shape: RoundedRectangleBorder(
                            borderRadius: BorderRadius.circular(10),
                          ),
                          child: Container(
                            margin: EdgeInsets.all(10),
                            child:  Row(children: [
                               Container(margin: EdgeInsets.only(right: 10),child:Icon(Icons.train,color: Colors.blue,)),
                                    Container(child:Text(item[index],style: TextStyle(fontSize:20,fontWeight: FontWeight.bold,color:Colors.black))),
                                ],),),
                             ),);},),),
              Container(margin: EdgeInsets.only(top:20,bottom: 5),
                child: ElevatedButton(
                  child: const Text('検索'),
                  style: ElevatedButton.styleFrom(primary: Colors.yellow[800], onPrimary: Colors.white, shape: const StadiumBorder(),),
                  onPressed: () {},
                ),),

            ]))
    );
  }
  void _loadData()  {
    switch(widget.Select) {
      case '北海道':item = ["JR函館本線(函館〜長万部)","JR函館本線(長万部〜小樽)","JR函館本線(小樽〜旭川)","JR室蘭本線(長万部・室蘭〜苫小牧)","JR室蘭本線(苫小牧〜岩見沢)","JR根室本線(滝川〜新得)","JR根室本線(新得〜釧路)","JR根室本線(花咲線)(釧路〜根室)","JR千歳線","JR石勝線","JR日高本線","JR札沼線","JR留萌本線","JR富良野線","JR宗谷本線","JR石北本線","JR釧網本線","JR江差線","札幌市営地下鉄東西線","札幌市営地下鉄南北線","札幌市営地下鉄東豊線","札幌市電山鼻線","函館市電２系統","函館市電５系統"];break;
      case '青森県':item = ["JR海峡線","JR奥羽本線(新庄〜青森)","JR大湊線(はまなすベイライン大湊線)","JR五能線","JR津軽線","JR八戸線","津軽鉄道","弘南鉄道弘南線","弘南鉄道大鰐線","いわて銀河鉄道","青い森鉄道"];break;
      case '岩手県':item = ["JR東北本線(黒磯〜利府・盛岡)","JR八戸線","JR岩泉線","JR北上線","JR釜石線(銀河ドリームライン釜石線)","JR大船渡線(ドラゴンレール大船渡線)","JR田沢湖線","JR花輪線(十和田八幡平四季彩ライン)","JR山田線","いわて銀河鉄道","三陸鉄道北リアス線","三陸鉄道南リアス線"];break;
      case '秋田県':item = ["JR奥羽本線(新庄〜青森)","JR五能線","JR北上線","JR羽越本線","JR花輪線(十和田八幡平四季彩ライン)","JR田沢湖線","JR男鹿線","秋田内陸縦貫鉄道","由利高原鉄道"];break;
      case '宮城県':item = ["JR東北本線(黒磯〜利府・盛岡)","JR大船渡線(ドラゴンレール大船渡線)","JR仙山線","JR石巻線","JR仙石線","JR陸羽東線(奥の細道湯けむりライン)","JR気仙沼線","JR常磐線(いわき〜仙台)","阿武隈急行","仙台市営地下鉄南北線","仙台空港線"];break;
      case '山形県':item = ["JR奥羽本線(新庄〜青森)","JR羽越本線","JR奥羽本線(山形線)(福島〜新庄)","JR仙山線","JR左沢線(フルーツライン左沢線)","JR米坂線","JR陸羽東線(奥の細道湯けむりライン)","JR陸羽西線(奥の細道最上川ライン)","山形鉄道フラワー長井線"];break;
      case '福島県':item = ["JR東北本線(黒磯〜利府・盛岡)","JR奥羽本線(山形線)(福島〜新庄)","JR磐越西線(郡山〜会津若松)","JR磐越西線(森と水とロマンの鉄道)","JR只見線","JR磐越東線(ゆうゆうあぶくまライン)","JR水郡線","JR常磐線(いわき〜仙台)","JR常磐線(取手〜いわき)","阿武隈急行","福島交通飯坂線","会津鉄道","野岩鉄道会津鬼怒川線"];break;
      case '新潟県':item = ["JR羽越本線","JR米坂線","JR磐越西線(森と水とロマンの鉄道)","JR信越本線(篠ノ井〜直江津)","JR上越線","JR只見線","JR信越本線(直江津〜新潟)","JR北陸本線(富山〜直江津)","JR白新線","JR大糸線","JR越後線","JR飯山線","JR弥彦線","北越急行ほくほく線"];break;
      case '富山県':item = ["JR北陸本線(富山〜直江津)","JR北陸本線(米原〜富山)","JR高山本線","JR氷見線","JR城端線","富山地鉄本線","富山地鉄立山線","富山地鉄不二越・上滝線","富山地鉄市内線","黒部峡谷鉄道","万葉線","富山ライトレール"];break;
      case '石川県':item = ["JR北陸本線(米原〜富山)","JR七尾線","北陸鉄道石川線","北陸鉄道浅野川線","のと鉄道七尾線"];break;
      case '福井県':item = ["JR北陸本線(米原〜富山)","JR越美北線(九頭竜線)","JR小浜線","えちぜん鉄道勝山永平寺線","えちぜん鉄道三国芦原線","福井鉄道福武線"];break;
      case '山梨県':item = ["JR中央本線(東京〜塩尻)","JR小海線(八ヶ岳高原線)","JR身延線","富士急行"];break;
      case '長野県':item = ["JR中央本線(東京〜塩尻)","JR小海線(八ヶ岳高原線)","JR信越本線(篠ノ井〜直江津)","JR中央本線(名古屋〜塩尻)","JR大糸線","JR飯山線","JR篠ノ井線","JR飯田線(豊橋〜天竜峡)","JR飯田線(天竜峡〜辰野)","しなの鉄道","上田電鉄別所線","長野電鉄長野線","松本電鉄上高地線"];break;
      case '栃木県':item = ["JR東北本線(黒磯〜利府・盛岡)","JR東北本線(宇都宮線)","JR烏山線","JR水戸線","JR日光線","JR両毛線","東武伊勢崎線","東武日光線","東武宇都宮線","東武佐野線","東武鬼怒川線","わたらせ渓谷鐵道","関東鉄道常総線","真岡鐵道","野岩鉄道会津鬼怒川線"];break;
      case '群馬県':item = ["JR八高線(高麗川〜高崎)","JR高崎線","JR吾妻線","JR信越本線","JR両毛線","JR上越線","東武伊勢崎線","東武日光線","東武佐野線","東武小泉線","東武桐生線","わたらせ渓谷鐵道","上信電鉄","上毛電気鉄道"];break;
      case '茨城県':item = ["JR常磐線(取手〜いわき)","JR東北本線(宇都宮線)","JR常磐線(上野〜取手)","JR水戸線","JR水郡線","JR鹿島線","つくばエクスプレス","ひたちなか海浜鉄道湊線","関東鉄道常総線","関東鉄道竜ヶ崎線","鹿島臨海鉄道大洗鹿島線","真岡鐵道"];break;
      case '埼玉県':item = ["JR武蔵野線","JR八高線(八王子〜高麗川)","JR八高線(高麗川〜高崎)","JR川越線","JR埼京線","JR東北本線(宇都宮線)","JR高崎線","JR成田エクスプレス","JR京浜東北線","JR湘南新宿ライン","東武東上線","東武伊勢崎線","東武日光線","東武越生線","東武野田線","西武池袋線","西武秩父線","西武狭山線","西武新宿線","西武山口線","東京メトロ有楽町線","東京メトロ副都心線","秩父鉄道","埼玉高速鉄道","つくばエクスプレス","埼玉新都市交通伊奈線"];break;
      case '東京都':item = ["JR東海道本線(東京〜熱海)","JR山手線","JR南武線","JR横須賀線","JR横浜線","JR武蔵野線","JR中央本線(東京〜塩尻)","JR中央線(快速)","JR中央・総武線","JR五日市線","JR青梅線","JR総武本線","JR八高線(八王子〜高麗川)","JR東北本線(宇都宮線)","JR常磐線(上野〜取手)","JR京葉線","JR高崎線","JR埼京線","JR成田エクスプレス","JR京浜東北線","JR湘南新宿ライン","東武東上線","東武伊勢崎線","東武亀戸線","東武大師線","西武池袋線","西武有楽町線","西武豊島線","西武拝島線","西武新宿線","西武山口線","西武西武園線","西武国分寺線","西武多摩湖線","西武多摩川線","京成本線","京成押上線","京成金町線","京成成田空港線(成田スカイアクセス)","京王京王線","京王相模原線","京王高尾線","京王競馬場線","京王動物園線","京王井の頭線","小田急小田原線","小田急多摩線","東急東横線","東急目黒線","東急田園都市線","東急大井町線","東急池上線","東急多摩川線","東急世田谷線","京急本線","京急空港線","東京メトロ銀座線","東京メトロ丸ノ内線","東京メトロ日比谷線","東京メトロ東西線","東京メトロ千代田線","東京メトロ有楽町線","東京メトロ半蔵門線","東京メトロ南北線","東京メトロ副都心線","都営大江戸線","都営浅草線","都営三田線","都営都電荒川線","都営新宿線","埼玉高速鉄道","つくばエクスプレス","ゆりかもめ","多摩モノレール","東京モノレール","東京臨海高速鉄道","北総鉄道"];break;
      case '千葉県':item = ["JR武蔵野線","JR中央・総武線","JR総武本線","JR外房線","JR内房線","JR常磐線(上野〜取手)","JR京葉線","JR成田線","JR成田エクスプレス","JR東金線","JR久留里線","JR鹿島線","東武野田線","京成本線","京成千葉線","京成千原線","京成成田空港線(成田スカイアクセス)","東京メトロ東西線","都営新宿線","いすみ鉄道","つくばエクスプレス","ユーカリが丘線","芝山鉄道","小湊鉄道","新京成電鉄線","千葉都市モノレール１号線","千葉都市モノレール２号線","流鉄流山線","銚子電鉄線","東葉高速鉄道","北総鉄道"];break;
      case '神奈川県':item = ["JR東海道本線(東京〜熱海)","JR南武線","JR鶴見線","JR横須賀線","JR根岸線","JR横浜線","JR相模線","JR中央本線(東京〜塩尻)","JR成田エクスプレス","JR御殿場線","JR湘南新宿ライン","JR京浜東北線","京王相模原線","小田急小田原線","小田急江ノ島線","小田急多摩線","東急東横線","東急目黒線","東急田園都市線","東急大井町線","東急こどもの国線","京急本線","京急大師線","京急逗子線","京急久里浜線","相鉄本線","相鉄いずみ野線","みなとみらい線","伊豆箱根鉄道大雄山線","横浜市営地下鉄ブルーライン・グリーンライン","横浜新都市交通金沢シーサイドライン","江ノ島電鉄線","湘南モノレール","箱根登山鉄道"];break;
      case '岐阜県': item = ["JR中央本線(名古屋〜塩尻)","JR高山本線","JR東海道本線(浜松〜岐阜)","JR東海道本線(岐阜〜美濃赤坂・米原)","JR太多線","名鉄名古屋本線","名鉄犬山線","名鉄各務原線","名鉄広見線","名鉄竹鼻線","名鉄羽島線","明知鉄道","長良川鉄道越美南線","樽見鉄道","養老鉄道養老線"];break;
      case '静岡県':item = ["JR東海道本線(東京〜熱海)","JR身延線","JR飯田線(豊橋〜天竜峡)","JR伊東線","JR東海道本線(浜松〜岐阜)","JR東海道本線(熱海〜浜松)","JR御殿場線","伊豆急行","伊豆箱根鉄道駿豆線","岳南鉄道","静岡鉄道静岡清水線","天竜浜名湖鉄道","遠州鉄道","大井川鐵道大井川本線","大井川鐵道井川線"];break;
      case '愛知県':item = ["JR中央本線(名古屋〜塩尻)","JR飯田線(豊橋〜天竜峡)","JR東海道本線(浜松〜岐阜)","JR関西本線(名古屋〜亀山)","JR武豊線","名鉄名古屋本線","名鉄豊川線","名鉄西尾線","名鉄豊田線","名鉄三河線","名鉄蒲郡線","名鉄空港線","名鉄常滑線","名鉄河和線","名鉄瀬戸線","名鉄築港線","名鉄知多新線","名鉄津島線","名鉄尾西線","名鉄犬山線","名鉄小牧線","名鉄広見線","近鉄名古屋線","西名古屋港線(あおなみ線)","東海交通事業城北線","愛知環状鉄道","東部丘陵線(リニモ)","名古屋市営地下鉄東山線","名古屋市営地下鉄名城線","名古屋市営地下鉄名港線","名古屋市営地下鉄上飯田線","名古屋市営地下鉄桜通線","名古屋市営地下鉄鶴舞線","豊橋鉄道渥美線","豊橋鉄道東田本線","ゆとりーとライン",];break;
      case '三重県':item = ["JR関西本線(名古屋〜亀山)","JR関西本線(亀山〜加茂)","JR紀勢本線","JR草津線","JR参宮線","JR名松線","近鉄大阪線","近鉄湯の山線","近鉄山田線","近鉄鳥羽線","近鉄内部線","近鉄八王子線","近鉄名古屋線","近鉄鈴鹿線","近鉄志摩線","三岐鉄道三岐線","三岐鉄道北勢線","伊勢鉄道","伊賀鉄道伊賀線","養老鉄道養老線"];break;
      case '滋賀県':item = ["JR北陸本線(米原〜富山)","JR東海道本線(岐阜〜美濃赤坂・米原)","JR草津線","JR東海道本線(琵琶湖線)(米原〜京都)","JR湖西線","京阪京津線","京阪石山坂本線","近江鉄道本線","近江鉄道多賀線","近江鉄道八日市線","信楽高原鐵道"];break;
      case '京都府':item = ["JR小浜線","JR関西本線(亀山〜加茂)","JR東海道本線(琵琶湖線)(米原〜京都)","JR東海道本線(京都線)(京都〜大阪)","JR湖西線","JR関西本線(大和路線)(加茂〜ＪＲ難波)","JR山陰本線(嵯峨野線)(京都〜園部)","JR山陰本線(園部〜豊岡)","JR片町線(学研都市線)","JR奈良線","JR舞鶴線","JR福知山線(篠山口〜福知山)","近鉄京都線","京阪本線","京阪宇治線","京阪鴨東線","京阪男山ケーブル","京阪京津線","阪急京都本線","阪急嵐山線","嵯峨野観光鉄道","叡山電鉄叡山本線","叡山電鉄鞍馬線","北近畿タンゴ鉄道宮福線","北近畿タンゴ鉄道宮津線","京都市営地下鉄烏丸線","京都市営地下鉄東西線","京福電鉄嵐山本線","京福電鉄北野線"];break;
      case '大阪府':item = ["JR東海道本線(京都線)(京都〜大阪)","JR東海道本線(神戸線)(大阪〜神戸)","JR関西本線(大和路線)(加茂〜ＪＲ難波)","JR片町線(学研都市線)","JR大阪環状線","JR桜島線(ゆめ咲線)","JR東西線","JR阪和線(天王寺〜和歌山)","JR阪和線(鳳〜東羽衣)","JR関西空港線","JR福知山線(宝塚線)(新大阪〜篠山口)","JRおおさか東線","近鉄難波線","近鉄南大阪線","近鉄大阪線","近鉄道明寺線","近鉄奈良線","近鉄信貴線","近鉄長野線","近鉄けいはんな線","近鉄西信貴ケーブル","南海本線","南海空港線","南海高師浜線","南海多奈川線","南海高野線(りんかんサンライン)","南海汐見橋線","京阪本線","京阪交野線","京阪中之島線","阪急神戸本線","阪急宝塚本線","阪急京都本線","阪急箕面線","阪急千里線","阪神本線","阪神なんば線","北大阪急行電鉄","泉北高速鉄道線","水間鉄道","大阪市営地下鉄御堂筋線","大阪市営地下鉄谷町線","大阪市営地下鉄四つ橋線","大阪市営地下鉄中央線","大阪市営地下鉄千日前線","大阪市営地下鉄堺筋線","大阪市営地下鉄長堀鶴見緑地線","大阪市営地下鉄南港ポートタウン線","大阪市営地下鉄今里筋線","大阪モノレール線","大阪モノレール彩都線","阪堺電軌上町線","阪堺電軌阪堺線","能勢電鉄妙見線"];break;
      case '兵庫県':item = ["JR東海道本線(神戸線)(大阪〜神戸)","JR山陽本線(神戸線)(神戸〜姫路)","JR山陽本線(姫路〜岡山)","JR山陽本線(兵庫〜和田岬)","JR山陰本線(園部〜豊岡)","JR山陰本線(豊岡〜米子)","JR東西線","JR福知山線(宝塚線)(新大阪〜篠山口)","JR福知山線(篠山口〜福知山)","JR赤穂線","JR加古川線","JR姫新線(姫路〜佐用)","JR播但線","JR姫新線(佐用〜新見)","阪急神戸本線","阪急宝塚本線","阪急今津線","阪急甲陽線","阪急伊丹線","阪神本線","阪神なんば線","阪神武庫川線","北近畿タンゴ鉄道宮津線","神戸高速東西線","神戸高速南北線","神鉄有馬線","神鉄三田線","神鉄公園都市線","神鉄粟生線","北神急行電鉄","山陽電鉄本線","山陽電鉄網干線","能勢電鉄妙見線","北条鉄道","智頭急行","神戸市営地下鉄西神線","神戸市営地下鉄山手線","神戸市営地下鉄海岸線(夢かもめ)","神戸新交通ポートアイランド線","神戸新交通六甲アイランド線"];break;
      case '奈良県':item = ["JR関西本線(大和路線)(加茂〜ＪＲ難波)","JR奈良線","JR和歌山線","JR桜井線","近鉄橿原線","近鉄南大阪線","近鉄大阪線","近鉄吉野線","近鉄天理線","近鉄生駒線","近鉄田原本線","近鉄御所線","近鉄奈良線","近鉄けいはんな線","近鉄京都線","近鉄生駒ケーブル"];break;
      case '和歌山県':item = ["JR紀勢本線","JR阪和線(天王寺〜和歌山)","JR和歌山線","JR紀勢本線(きのくに線)(新宮〜和歌山)","JR紀勢本線(和歌山〜和歌山市)","南海本線","南海和歌山港線","南海加太線","南海高野線(りんかんサンライン)","南海高野山ケーブル","紀州鉄道","わかやま電鉄貴志川線"];break;
      case '鳥取県':item = ["JR山陰本線(豊岡〜米子)","JR山陰本線(米子〜益田)","JR伯備線","JR因美線","JR境線","智頭急行","若桜鉄道"];break;
      case '島根県':item = ["JR山陰本線(米子〜益田)","JR山陰本線(益田〜下関)","JR木次線","JR山口線","JR三江線","一畑電車北松江線","一畑電車大社線"];break;
      case '岡山県':item = ["JR山陽本線(姫路〜岡山)","JR山陽本線(岡山〜三原)","JR赤穂線","JR姫新線(佐用〜新見)","JR伯備線","JR因美線","JR宇野線","JR本四備讃線(瀬戸大橋線)","JR吉備線","JR芸備線","JR津山線","智頭急行","水島臨海鉄道","井原鉄道","岡山電軌東山本線","岡山電軌清輝橋線"];break;
      case '広島県':item = ["JR山陽本線(岡山〜三原)","JR山陽本線(三原〜岩国)","JR木次線","JR三江線","JR芸備線","JR呉線","JR可部線","JR福塩線","井原鉄道","スカイレールサービス","アストラムライン","広電１系統(宇品線)","広電２系統(宮島線)","広電３系統(己斐線)","広電５系統(比治山線)","広電６系統(江波線)","広電７系統(都心線)","広電８系統(横川線)","広電９系統(白島線)",];break;
      case '山口県':item = ["JR山陽本線(三原〜岩国)","JR山陽本線(岩国〜門司)","JR山陰本線(益田〜下関)","JR山口線","JR宇部線","JR美祢線","JR小野田線","JR岩徳線","JR鹿児島本線(下関・門司港〜博多)","錦川鉄道錦川清流線"];break;
      case '徳島県':item = ["JR土讃線","JR高徳線","JR徳島線(よしの川ブルーライン)","JR牟岐線","JR鳴門線","阿佐海岸鉄道阿佐東線"];break;
      case '香川県':item = ["JR本四備讃線(瀬戸大橋線)","JR土讃線","JR高徳線","JR予讃線","琴電琴平線","琴電長尾線","琴電志度線"];break;
      case '愛媛県':item = ["JR予讃線","JR予讃・内子線","JR予土線(しまんとグリーンライン)","伊予鉄道郡中線","伊予鉄道高浜線","伊予鉄道横河原線","伊予鉄道１系統(環状線)","伊予鉄道２系統(環状線)","伊予鉄道３系統(市駅線)","伊予鉄道５系統(松山駅前線)","伊予鉄道６系統(本町線)"];break;
      case '高知県':item = ["JR土讃線","JR予土線(しまんとグリーンライン)","阿佐海岸鉄道阿佐東線","土佐くろしお鉄道中村線","土佐くろしお鉄道中村線","土佐くろしお鉄道ごめん・なはり線","土佐電鉄ごめん線","土佐電鉄伊野線","土佐電鉄桟橋線"];break;
      case '福岡県':item = ["JR山陽本線(岩国〜門司)","JR博多南線","JR鹿児島本線(下関・門司港〜博多)","JR篠栗線(福北ゆたか線)","JR日豊本線(門司港〜佐伯)","JR鹿児島本線(博多〜八代)","JR日豊本線(門司港〜佐伯)","JR篠栗線(福北ゆたか線)","JR筑豊本線(若松線)(若松〜折尾)","JR筑豊本線(福北ゆたか線)(折尾〜桂川)","JR筑豊本線(原田線)(桂川〜原田)","JR筑肥線(姪浜〜西唐津)","JR久大本線(ゆふ高原線)","JR日田彦山線","JR後藤寺線","JR香椎線(海の中道線)(西戸崎〜香椎)","JR香椎線(香椎〜宇美)","西鉄天神大牟田線","西鉄太宰府線","西鉄甘木線","西鉄貝塚線","甘木鉄道","平成筑豊鉄道伊田線","平成筑豊鉄道糸田線","平成筑豊鉄道田川線","福岡市営地下鉄空港線","福岡市営地下鉄箱崎線","福岡市営地下鉄七隈線","北九州高速鉄道","筑豊電気鉄道"];break;
      case '佐賀県':item = ["JR鹿児島本線(博多〜八代)","JR長崎本線(鳥栖〜長崎)","JR筑肥線(姪浜〜西唐津)","JR佐世保線","JR筑肥線(西唐津〜伊万里)","JR唐津線","甘木鉄道","松浦鉄道西九州線(有田〜伊万里)","松浦鉄道西九州線(伊万里〜佐世保)"];break;
      case '長崎県':item = ["JR長崎本線(鳥栖〜長崎)","JR佐世保線","JR大村線","松浦鉄道西九州線(伊万里〜佐世保)","島原鉄道","長崎電軌１系統","長崎電軌３系統","長崎電軌４系統","長崎電軌５系統"];break;
      case '熊本県':item = ["JR鹿児島本線(博多〜八代)","JR豊肥本線(阿蘇高原線)","JR三角線","JR肥薩線(えびの高原線)(八代〜吉松)","熊本電鉄本線","熊本電鉄上熊本線","南阿蘇鉄道高森線","くま川鉄道湯前線","肥薩おれんじ鉄道","熊本市電Ａ系統","熊本市電Ｂ系統"];break;
      case '大分県':item = ["JR日豊本線(門司港〜佐伯)","JR日豊本線(佐伯〜鹿児島中央)","JR久大本線(ゆふ高原線)","JR日田彦山線","JR豊肥本線(阿蘇高原線)"];break;
      case '宮崎県':item = ["JR日豊本線(佐伯〜鹿児島中央)","JR肥薩線(えびの高原線)(八代〜吉松)","JR宮崎空港線","JR日南線","JR吉都線(えびの高原線)"];break;
      case '鹿児島県':item = ["JR鹿児島本線(川内〜鹿児島)","JR日豊本線(佐伯〜鹿児島中央)","JR肥薩線(えびの高原線)(八代〜吉松)","JR肥薩線(吉松〜隼人)","JR日南線","JR吉都線(えびの高原線)","JR指宿枕崎線","肥薩おれんじ鉄道","鹿児島市電１系統","鹿児島市電２系統",];break;
      case '沖縄県':item = ["ゆいレール"];break;
      default:
        break;
    } setState(() {});
  }
}